docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
% Created 2026-02-22 Sun 22:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Prologos Project — from Zachary Larson}
\date{2026-02-22}
\title{Extended Spec Language Design\\\medskip
\large Toward Editor-Assisted Interactive Development}
\hypersetup{
 pdfauthor={Prologos Project — from Zachary Larson},
 pdftitle={Extended Spec Language Design},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Executive Summary}
\label{sec:org9c2dd4c}

This document proposes extending Prologos's surface language with three
coordinated features that make dependent types, properties, and higher-kinded
abstractions approachable without sacrificing formal rigor:

\begin{enumerate}
\item \textbf{Extended \texttt{spec}} with keyword metadata (\texttt{:implicits}, \texttt{:where}, \texttt{:doc},
\texttt{:examples}, \texttt{:properties}, contracts, refinements)
\item \textbf{\texttt{property} keyword} for reusable, composable proposition groups (analogous
to \texttt{bundle} for traits), with \texttt{:includes} composition and \texttt{:laws} on traits
\item \textbf{\texttt{functor} keyword} for named type abstractions with category-theoretic
metadata (\texttt{:unfolds}, \texttt{:compose}, \texttt{:identity}, \texttt{:laws}) --- eliminating
raw Pi/Sigma types from the surface language
\item \textbf{\texttt{??} typed holes} for interactive, hole-driven development
\end{enumerate}

The design philosophy: \emph{dependent types are the implementation substrate; the
surface language speaks in domain terms}. Pi types, Sigma types, universe
levels, and multiplicity annotations exist in \texttt{:unfolds} blocks, in the
elaborator, and in the type checker. The primary programmer interface is
structured metadata expressed through keywords.

The design is informed by a survey of Clojure Spec, Malli, PropEr, Agda, Idris,
Lean 4, Haskell, F*, Koka, and Racket contracts. Property-based testing and
interactive theorem proving are explicit design \emph{targets} (we design syntax to
support them) but not implementation targets (we do not build the engines yet).
\subsection{Keyword Symmetry Table}
\label{sec:orgcbaef95}

\begin{center}
\begin{tabular}{llll}
Abstraction layer & Keyword & What it names & Analogous to\\
\hline
Function interface & \texttt{spec} & Function type + metadata & ML type signatures\\
Method requirement & \texttt{trait} & A single method signature & Haskell typeclass method\\
Requirement group & \texttt{bundle} & Conjunction of traits & Haskell superclass constraint\\
Proposition group & \texttt{property} & Conjunction of \texttt{:holds} clauses & QuickCheck property suites\\
Type abstraction & \texttt{functor} & Parameterized type + algebraic structure & CT functor / Lean \texttt{abbrev}, but richer\\
\end{tabular}
\end{center}
\section{Part I: Research Survey}
\label{sec:org527adb9}

\subsection{1. Clojure Spec \& Malli}
\label{sec:orga562454}
