docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.org
*** Clojure Spec

Clojure Spec (~clojure.spec.alpha~) is /predicate-first/: every spec is
fundamentally a predicate function. The key insight for Prologos is the three
facets of ~s/fdef~:

#+begin_src clojure
(s/fdef ranged-rand
  :args (s/cat :start int? :end int?)
  :ret  int?
  :fn   (fn [{:keys [args ret]}]
          (and (>= ret (:start args))
               (<  ret (:end args)))))
#+end_src

- *=:args=*: regex spec for function arguments (~s/cat~, ~s/alt~)
- *=:ret=*: spec for the return value
- *=:fn=*: predicate relating ~{:args conformed-args :ret conformed-ret}~

The =:fn= relation is the most interesting for Prologos --- it expresses
/properties/ that must hold between inputs and outputs. In a dependently-typed
language, this corresponds directly to a dependent Pi type.

*Generative testing*: ~stest/check~ generates random inputs from ~:args~,
invokes the function, and checks both ~:ret~ and ~:fn~. Specs /are/ generators
--- no separate test-writing step required. This is QuickCheck-style property
testing with zero user-written generators.

*Instrument vs check*: ~instrument~ validates ~:args~ at call sites
(development-time contract enforcement). ~check~ validates ~:ret~ and ~:fn~ via
generative testing (test-time property verification). This separation is
important: /contracts at dev time, properties at test time/.

*Composition*: ~s/keys~ for entity maps, ~s/cat~ for sequential concatenation,
~s/alt~ for alternatives, ~s/and~ for conjunctive refinement. Specs compose
algebraically.

*** Malli

Malli is /schema-first/ (data-driven): schemas are plain data structures, not
opaque predicate objects. This enables schema transformation, generation,
serialization.

#+begin_src clojure
(def MyFunction
  [:=> [:cat :int :int] :int])

;; Schema-as-data enables programmatic manipulation:
(m/children MyFunction) ;; => [[:cat :int :int] :int]
#+end_src

*Key lesson*: In a homoiconic language like Prologos, spec metadata should be
data --- quotable, inspectable, transformable. This is naturally satisfied by
using maps.

*** Insight for Prologos

In a dependently-typed language, types already subsume specs. Clojure's =:fn=
relation corresponds to a dependent Pi type:

#+begin_src prologos
;; Clojure spec's :fn relation for ranged-rand:
;; (fn [{:keys [args ret]}] (and (>= ret start) (< ret end)))

;; Is expressible as the dependent type:
;; <(start : Int) -> (end : Int) -> {v : Int | v >= start, v < end}>
#+end_src

Runtime property testing remains valuable even when types encode the invariant:
the type checker catches /logical/ errors at compile time; property testing
catches /implementation/ bugs.

** 2. PropEr (Erlang Property-Based Testing)

PropEr is notable for its /type-driven generator synthesis/. If a function has a
Dialyzer type spec, PropEr constructs generators automatically:

#+begin_src erlang
-spec foo(integer(), string()) -> boolean().
%% PropEr generates random (integer, string) pairs and checks boolean result
#+end_src

*Compositional shrinking*: When custom generators are built from other
generators, shrinking behavior inherits automatically. Data structures
containing other data "tend to empty themselves."

*Property patterns*: ~?FORALL(Xs, Generator, Property)~ is the canonical form.
~?IMPLIES~ for conditional properties. ~aggregate/collect~ for coverage.

*Insight for Prologos*: Our types are richer than Dialyzer specs. A ~spec~ with
dependent types gives enough information to auto-generate random inputs. The
generator infrastructure should be type-directed: ~Gen : Type -> Generator~ as a
trait, with automatic derivation for algebraic data types.

** 3. Agda/Idris Interactive Development

*** Agda

Agda's hole-driven development is the gold standard for interactive type-driven
programming:

- *Holes*: ~?~ in code creates a /hole/ (placeholder for incomplete code). The
  type checker reports the expected type and available local bindings.

- *Commands*:
  | Key | Action | Description |
  |-------+--------+-----------------------------------------|
  | ~C-c C-r~ | Refine | Fill hole with expression + new sub-holes |
  | ~C-c C-c~ | Case | Split on a variable (pattern match) |
  | ~C-c C-a~ | Auto | Proof search (try constructors) |
  | ~C-c C-,~ | Goal | Show expected type and context |

- *Auto proof search*: Completely rewritten in Agda 2.7.0. Searches for type
  inhabitants by trying constructors and projections. Works for "small enough
  problems of almost any kind." Users provide hints via constants or scope.

