docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex

\subsubsection{Clojure Spec}
\label{sec:org99aa5bc}

Clojure Spec (\texttt{clojure.spec.alpha}) is \emph{predicate-first}: every spec is
fundamentally a predicate function. The key insight for Prologos is the three
facets of \texttt{s/fdef}:

\begin{verbatim}
(s/fdef ranged-rand
  :args (s/cat :start int? :end int?)
  :ret  int?
  :fn   (fn [{:keys [args ret]}]
          (and (>= ret (:start args))
               (<  ret (:end args)))))
\end{verbatim}

\begin{itemize}
\item \textbf{\texttt{:args}}: regex spec for function arguments (\texttt{s/cat}, \texttt{s/alt})
\item \textbf{\texttt{:ret}}: spec for the return value
\item \textbf{\texttt{:fn}}: predicate relating \texttt{\{:args conformed-args :ret conformed-ret\}}
\end{itemize}

The \texttt{:fn} relation is the most interesting for Prologos --- it expresses
\emph{properties} that must hold between inputs and outputs. In a dependently-typed
language, this corresponds directly to a dependent Pi type.

\textbf{Generative testing}: \texttt{stest/check} generates random inputs from \texttt{:args},
invokes the function, and checks both \texttt{:ret} and \texttt{:fn}. Specs \emph{are} generators
--- no separate test-writing step required. This is QuickCheck-style property
testing with zero user-written generators.

\textbf{Instrument vs check}: \texttt{instrument} validates \texttt{:args} at call sites
(development-time contract enforcement). \texttt{check} validates \texttt{:ret} and \texttt{:fn} via
generative testing (test-time property verification). This separation is
important: \emph{contracts at dev time, properties at test time}.

\textbf{Composition}: \texttt{s/keys} for entity maps, \texttt{s/cat} for sequential concatenation,
\texttt{s/alt} for alternatives, \texttt{s/and} for conjunctive refinement. Specs compose
algebraically.
\subsubsection{Malli}
\label{sec:org8d95780}

Malli is \emph{schema-first} (data-driven): schemas are plain data structures, not
opaque predicate objects. This enables schema transformation, generation,
serialization.

\begin{verbatim}
(def MyFunction
  [:=> [:cat :int :int] :int])

;; Schema-as-data enables programmatic manipulation:
(m/children MyFunction) ;; => [[:cat :int :int] :int]
\end{verbatim}

\textbf{Key lesson}: In a homoiconic language like Prologos, spec metadata should be
data --- quotable, inspectable, transformable. This is naturally satisfied by
using maps.
\subsubsection{Insight for Prologos}
\label{sec:orgd66419d}

In a dependently-typed language, types already subsume specs. Clojure's \texttt{:fn}
relation corresponds to a dependent Pi type:

\begin{verbatim}
;; Clojure spec's :fn relation for ranged-rand:
;; (fn [{:keys [args ret]}] (and (>= ret start) (< ret end)))

;; Is expressible as the dependent type:
;; <(start : Int) -> (end : Int) -> {v : Int | v >= start, v < end}>
\end{verbatim}

Runtime property testing remains valuable even when types encode the invariant:
the type checker catches \emph{logical} errors at compile time; property testing
catches \emph{implementation} bugs.
\subsection{2. PropEr (Erlang Property-Based Testing)}
\label{sec:org5592240}

PropEr is notable for its \emph{type-driven generator synthesis}. If a function has a
Dialyzer type spec, PropEr constructs generators automatically:

\begin{verbatim}
-spec foo(integer(), string()) -> boolean().
%% PropEr generates random (integer, string) pairs and checks boolean result
\end{verbatim}

\textbf{Compositional shrinking}: When custom generators are built from other
generators, shrinking behavior inherits automatically. Data structures
containing other data "tend to empty themselves."

\textbf{Property patterns}: \texttt{?FORALL(Xs, Generator, Property)} is the canonical form.
\texttt{?IMPLIES} for conditional properties. \texttt{aggregate/collect} for coverage.

\textbf{Insight for Prologos}: Our types are richer than Dialyzer specs. A \texttt{spec} with
dependent types gives enough information to auto-generate random inputs. The
generator infrastructure should be type-directed: \texttt{Gen : Type -> Generator} as a
trait, with automatic derivation for algebraic data types.
\subsection{3. Agda/Idris Interactive Development}
\label{sec:org558e5a3}

\subsubsection{Agda}
\label{sec:org6f69a3e}

Agda's hole-driven development is the gold standard for interactive type-driven
programming:

\begin{itemize}
\item \textbf{Holes}: \texttt{?} in code creates a \emph{hole} (placeholder for incomplete code). The
type checker reports the expected type and available local bindings.

\item \textbf{Commands}:
\begin{center}
\begin{tabular}{lll}
Key & Action & Description\\
\hline
\texttt{C-c C-r} & Refine & Fill hole with expression + new sub-holes\\
\texttt{C-c C-c} & Case & Split on a variable (pattern match)\\
\texttt{C-c C-a} & Auto & Proof search (try constructors)\\
\texttt{C-c C-,} & Goal & Show expected type and context\\
\end{tabular}
\end{center}

\item \textbf{Auto proof search}: Completely rewritten in Agda 2.7.0. Searches for type
inhabitants by trying constructors and projections. Works for "small enough
problems of almost any kind." Users provide hints via constants or scope.
\end{itemize}
