docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.org
*** Idris 2

Idris's interactive editing provides similar capabilities with a different
flavor:

- *Holes*: ~?name~ syntax. The REPL shows expected type and context.

- *Commands*:
  | Command | Description |
  |---------+----------------------------------------------|
  | ~:ac~ | Add clause template for a function |
  | ~:cs~ | Case split on variable (removes impossible cases) |
  | ~:am~ | Add missing clauses |
  | ~:ps~ | Proof search |
  | ~:mw~ | Make with clause |

- *Case splitting* (~:cs~): Removes /impossible/ cases due to unification ---
  this is type-directed case analysis. When a constructor can't unify with the
  expected type, the case is silently omitted.

*** Insight for Prologos

The ~??~ syntax naturally maps to our existing ~expr-hole~ infrastructure
(~syntax.rkt~ line 688). The type checker already handles ~expr-hole~ --- it
accepts any type. The missing piece is the /interactive protocol/: the editor
asks "what type is expected here, what bindings are in scope?" and the type
checker reports back.

Key distinction: ~_~ means "infer this for me automatically" (silent, automatic).
~??~ means "I don't know what goes here, please help me" (interactive,
informational). The former is for the machine; the latter is for the human.

** 4. Dependent Type Ergonomics

*** How Languages Present Pi Types

| Language | Pi syntax | Implicit | Instance |
|----------+-----------------------------------+-----------+------------|
| Agda | ~(x : A) -> B~ | ~{x : A}~ | ~{{x : A}}~ |
| Idris 2 | ~(x : A) -> B~ | ~{x : A}~ | ~{auto x : A}~ |
| Lean 4 | ~(x : A) -> B~ | ~{x : A}~ | ~[x : A]~ |
| Prologos | ~<(x : A) -> B>~ | ~{A : Type}~ | where clause |

*The ergonomic tension*: Pi types with many parameters become hard to read.
All dependently-typed languages solve this the same way: separate the
/signature/ from the /definition/. Prologos's ~spec~/~defn~ split already
achieves this. The extended spec pushes further by structuring the metadata
around the signature.

*** Lean's ~abbrev~ vs ~def~ Distinction

Lean 4 distinguishes transparent abbreviations from opaque definitions:

- ~abbrev~ is tagged ~@[reducible]~ --- unfolded during elaboration, instance
  synthesis, and definitional equality checks. ~abbrev MyMonad := ReaderT Env IO~
  means ~Monad MyMonad~ resolves automatically via ~Monad (ReaderT ...)~.
- ~def~ (semireducible) is /not/ unfolded by instance synthesis. You need
  explicit instances for opaque type definitions.

This distinction is critical for type aliases that should "carry through" trait
instances vs abstract types that deliberately hide their representation.

*** Type-Level Functions in Dependently-Typed Languages

In Agda, Idris, and Lean, type synonyms are ordinary functions returning ~Type~.
No special mechanism needed. The tradeoff: full type-level computation makes
inference harder and error messages may show fully-reduced forms rather than the
user's abbreviation name.

Haskell's ~type~ synonyms are transparent but /cannot be partially applied/ ---
a fundamental restriction. Prologos should avoid this limitation.

*** Insight for Prologos

Our existing implicit argument inference (Sprint 3) and trait resolution (Phases
A--E) provide the core mechanisms. The ergonomic challenge is /presentation/ ---
how to show complex Pi types without overwhelming users. The extended ~spec~
addresses function-level presentation; the ~functor~ keyword (Part VII)
addresses type-level presentation.

** 5. Refinement Types (Liquid Haskell, F*)

*** Liquid Haskell

Refinement types refine base types with logical predicates:

#+begin_example
{v : T | predicate}
#+end_example

For functions, the return type can reference the input:

#+begin_example
incr :: x:Int -> {v:Int | v = x + 1}
#+end_example

Type checking reduces to SMT validity queries (static verification, not runtime
testing). Refinement reflection allows the SMT solver to reason about recursive
function implementations.

*** F*

Combines ML-like programming with dependent types, monadic effects, and
refinement types. Uses Z3 for automated verification. Programs extract to
OCaml, F#, or C.

F* provides fine-grained unfolding control: ~unfold~ (always reduce),
~unfold_for_unification_and_vcgen~ (reduce only during unification and VC
generation), or opaque (default). This three-tier system gives precise control
over where abbreviations are transparent.

*** Insight for Prologos

Prologos already has full dependent types, which /subsume/ refinement types:
~{v : Int | v > 0}~ in Liquid Haskell is expressible as
~<(v : Int) * (GT v 0)>~ (Sigma type pairing value with proof) in Prologos.

The ergonomic question: should we offer a lighter-weight refinement syntax
(~:refines~ key) that /compiles/ to Sigma types? Yes --- for pragmatism. Users
write ~:refines (fn [r] [>= r 0])~ and the compiler generates the Sigma type.

