docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsubsection{Idris 2}
\label{sec:org099d2d2}

Idris's interactive editing provides similar capabilities with a different
flavor:

\begin{itemize}
\item \textbf{Holes}: \texttt{?name} syntax. The REPL shows expected type and context.

\item \textbf{Commands}:
\begin{center}
\begin{tabular}{ll}
Command & Description\\
\hline
\texttt{:ac} & Add clause template for a function\\
\texttt{:cs} & Case split on variable (removes impossible cases)\\
\texttt{:am} & Add missing clauses\\
\texttt{:ps} & Proof search\\
\texttt{:mw} & Make with clause\\
\end{tabular}
\end{center}

\item \textbf{Case splitting} (\texttt{:cs}): Removes \emph{impossible} cases due to unification ---
this is type-directed case analysis. When a constructor can't unify with the
expected type, the case is silently omitted.
\end{itemize}
\subsubsection{Insight for Prologos}
\label{sec:org2e45f04}

The \texttt{??} syntax naturally maps to our existing \texttt{expr-hole} infrastructure
(\texttt{syntax.rkt} line 688). The type checker already handles \texttt{expr-hole} --- it
accepts any type. The missing piece is the \emph{interactive protocol}: the editor
asks "what type is expected here, what bindings are in scope?" and the type
checker reports back.

Key distinction: \texttt{\_} means "infer this for me automatically" (silent, automatic).
\texttt{??} means "I don't know what goes here, please help me" (interactive,
informational). The former is for the machine; the latter is for the human.
\subsection{4. Dependent Type Ergonomics}
\label{sec:orgd0ed6d4}

\subsubsection{How Languages Present Pi Types}
\label{sec:orgbc0ab8a}

\begin{center}
\begin{tabular}{llll}
Language & Pi syntax & Implicit & Instance\\
\hline
Agda & \texttt{(x : A) -> B} & \texttt{\{x : A\}} & \texttt{\{\{x : A\}\}}\\
Idris 2 & \texttt{(x : A) -> B} & \texttt{\{x : A\}} & \texttt{\{auto x : A\}}\\
Lean 4 & \texttt{(x : A) -> B} & \texttt{\{x : A\}} & \texttt{[x : A]}\\
Prologos & \texttt{<(x : A) -> B>} & \texttt{\{A : Type\}} & where clause\\
\end{tabular}
\end{center}

\textbf{The ergonomic tension}: Pi types with many parameters become hard to read.
All dependently-typed languages solve this the same way: separate the
\emph{signature} from the \emph{definition}. Prologos's \texttt{spec\textasciitilde{}/\textasciitilde{}defn} split already
achieves this. The extended spec pushes further by structuring the metadata
around the signature.
\subsubsection{Lean's \texttt{abbrev} vs \texttt{def} Distinction}
\label{sec:org8db01bb}

Lean 4 distinguishes transparent abbreviations from opaque definitions:

\begin{itemize}
\item \texttt{abbrev} is tagged \texttt{@[reducible]} --- unfolded during elaboration, instance
synthesis, and definitional equality checks. \texttt{abbrev MyMonad := ReaderT Env IO}
means \texttt{Monad MyMonad} resolves automatically via \texttt{Monad (ReaderT ...)}.
\item \texttt{def} (semireducible) is \emph{not} unfolded by instance synthesis. You need
explicit instances for opaque type definitions.
\end{itemize}

This distinction is critical for type aliases that should "carry through" trait
instances vs abstract types that deliberately hide their representation.
\subsubsection{Type-Level Functions in Dependently-Typed Languages}
\label{sec:orgad9ce56}

In Agda, Idris, and Lean, type synonyms are ordinary functions returning \texttt{Type}.
No special mechanism needed. The tradeoff: full type-level computation makes
inference harder and error messages may show fully-reduced forms rather than the
user's abbreviation name.

Haskell's \texttt{type} synonyms are transparent but \emph{cannot be partially applied} ---
a fundamental restriction. Prologos should avoid this limitation.
\subsubsection{Insight for Prologos}
\label{sec:orgd1994f9}

Our existing implicit argument inference (Sprint 3) and trait resolution (Phases
A--E) provide the core mechanisms. The ergonomic challenge is \emph{presentation} ---
how to show complex Pi types without overwhelming users. The extended \texttt{spec}
addresses function-level presentation; the \texttt{functor} keyword (Part VII)
addresses type-level presentation.
\subsection{5. Refinement Types (Liquid Haskell, F*)}
\label{sec:org3acded3}

\subsubsection{Liquid Haskell}
\label{sec:org38eba1d}

Refinement types refine base types with logical predicates:

\begin{verbatim}
{v : T | predicate}
\end{verbatim}

For functions, the return type can reference the input:

\begin{verbatim}
incr :: x:Int -> {v:Int | v = x + 1}
\end{verbatim}

Type checking reduces to SMT validity queries (static verification, not runtime
testing). Refinement reflection allows the SMT solver to reason about recursive
function implementations.
\subsubsection{F*}
\label{sec:org39f13fd}

Combines ML-like programming with dependent types, monadic effects, and
refinement types. Uses Z3 for automated verification. Programs extract to
OCaml, F\#, or C.

F* provides fine-grained unfolding control: \texttt{unfold} (always reduce),
\texttt{unfold\_for\_unification\_and\_vcgen} (reduce only during unification and VC
generation), or opaque (default). This three-tier system gives precise control
over where abbreviations are transparent.
\subsubsection{Insight for Prologos}
\label{sec:orgeb03883}

Prologos already has full dependent types, which \emph{subsume} refinement types:
\texttt{\{v : Int | v > 0\}} in Liquid Haskell is expressible as
\texttt{<(v : Int) * (GT v 0)>} (Sigma type pairing value with proof) in Prologos.

The ergonomic question: should we offer a lighter-weight refinement syntax
(\texttt{:refines} key) that \emph{compiles} to Sigma types? Yes --- for pragmatism. Users
write \texttt{:refines (fn [r] [>= r 0])} and the compiler generates the Sigma type.
