docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsection{6. Contract Systems \& Spec Language Design Patterns}
\label{sec:org5fdfeba}

\subsubsection{Racket Contracts}
\label{sec:orga7e7e90}

\texttt{->i} for dependent contracts with \texttt{\#:pre} and \texttt{\#:post} conditions. \texttt{define/contract}
establishes a contract boundary. Blame tracking identifies which party violated
the contract.
\subsubsection{Composability Patterns}
\label{sec:org94d7b6a}

\begin{itemize}
\item The Specification Pattern (Fowler) composes predicates via AND/OR/NOT combinators.
\item The "schema explosion" problem occurs when specs grow combinatorially. Solution:
keep specs \emph{open} (new keys without modifying existing specs) and \emph{compositional}
(specs combine via simple operations). Clojure handles this via \texttt{s/merge} and \texttt{s/and}.
\end{itemize}
\subsubsection{Koka Effect Aliases}
\label{sec:org57ffbc6}

Koka's \texttt{alias pure = <div,exn>} abbreviates a row of effects. This demonstrates
the general principle: named groupings of constraints improve readability.
Prologos's \texttt{bundle} already does this for trait constraints; \texttt{property} will do
this for propositions; \texttt{functor} will do this for type structure.
\subsubsection{Insight for Prologos}
\label{sec:orgb8a7d98}

The map argument to \texttt{spec} is inherently open and composable. New keys can be added
in future versions without breaking existing code. Unrecognized keys are stored
but not acted upon (\emph{Postel principle}: liberal in what you accept, conservative
in what you emit). Spec metadata should be first-class data (homoiconicity
principle) --- quotable, inspectable, transformable.
\subsection{7. Type Abbreviation Mechanisms (Cross-Language Survey)}
\label{sec:org86b98e3}

\subsubsection{Transparent Aliases}
\label{sec:org2d0c29d}

Haskell \texttt{type}, Rust \texttt{type}, Koka \texttt{alias}. Fully expanded before type checking;
zero impact on inference. Haskell's limitation: type synonyms cannot be partially
applied. Rust and Koka do not share this restriction.
\subsubsection{Opaque / Controlled-Reducibility Aliases}
\label{sec:org68ad41c}

Lean 4's \texttt{abbrev} (reducible, instances carry through) vs \texttt{def} (semireducible,
opaque to instance search). Scala 3's \texttt{opaque type} (transparent inside defining
scope, opaque outside). Haskell's \texttt{newtype} (distinct type, zero-cost at runtime).
\subsubsection{Module-Level Abstraction}
\label{sec:orgf845975}

OCaml modules control type visibility through signatures: same \texttt{type t = int}
can be exposed transparently or abstractly depending on the \texttt{.mli} file. 1ML
(Rossberg) unifies core and module language so type abbreviations are ordinary
first-class functions.
\subsubsection{Insight for Prologos}
\label{sec:org1f5afa5}

The \texttt{functor} keyword (Part VII) takes the Lean \texttt{abbrev} approach --- transparent
by default, with the added richness of category-theoretic metadata. Unlike bare
abbreviations, a \texttt{functor} declares what the type \emph{means} through its operations,
not just what it expands to.
\section{Part II: Syntax Design}
\label{sec:orga409653}

\subsection{Current Spec Syntax}
\label{sec:orgf7c6e8f}

\begin{verbatim}
;; Basic:
spec add Nat Nat -> Nat

;; With implicit binders:
spec id {A : Type} A -> A

;; With trait constraints (where clause):
spec sort {A : Type} [List A] -> [List A] where (Ord A)

;; With inline constraints:
spec elem {A} [Eq A] A [List A] -> Bool

;; Multi-arity:
spec zip
  | {A B : Type} [List A] [List B] -> [List [Pair A B]]
  | {A B C : Type} [A -> B -> C] [List A] [List B] -> [List C]
\end{verbatim}

The \texttt{spec-entry} struct (macros.rkt line 203) stores: \texttt{type-datums},
\texttt{docstring}, \texttt{multi?}, \texttt{srcloc}, \texttt{where-constraints}, \texttt{implicit-binders},
\texttt{rest-type}.
\subsection{Extended Spec Syntax}
\label{sec:orga45539c}

The extension uses Prologos's existing implicit map syntax. Keyword-headed
children after the type signature are collected into a metadata map:

\begin{verbatim}
spec sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :doc "Sorts a list in ascending order using merge sort"
  :examples
    - [sort '[3N 1N 2N]] => '[1N 2N 3N]
    - [sort '[]] => '[]
  :properties (sortable-laws A)
  :see-also [reverse filter]
\end{verbatim}
\subsubsection{The \texttt{:implicits} Key}
\label{sec:orge7189f4}

The \texttt{:implicits} key lifts implicit binders out of the type signature into
metadata, freeing the signature to express pure function shape:

\begin{verbatim}
;; Current (inline implicits):
spec gmap {A B : Type} {C : Type -> Type} (Seqable C) -> (Buildable C) -> [A -> B] -> [C A] -> [C B]

;; With :implicits + :where:
spec gmap [A -> B] -> [C A] -> [C B]
  :implicits {A B : Type} {C : Type -> Type}
  :where (Seqable C) (Buildable C)
\end{verbatim}

All three forms coexist:
\begin{enumerate}
\item Inline \texttt{\{A : Type\}} --- for quick one-liners
\item \texttt{:implicits} key --- for clean multi-line specs
\item Omitted entirely --- when inference handles it (already works for kind \texttt{Type})
\end{enumerate}

\textbf{Implementation}: In \texttt{process-spec}, extract \texttt{:implicits} from the metadata map
and merge with any inline \texttt{\{...\}} binders. The \texttt{extract-implicit-binders}
function already returns \texttt{(values implicit-binders remaining-tokens)} --- union
the two sources. Duplicate binders (same name in both) emit a warning and
deduplicate.
