docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.md


<a id="orgab89864"></a>

## 6. Contract Systems & Spec Language Design Patterns


<a id="orgdd571ec"></a>

### Racket Contracts

`->i` for dependent contracts with `#:pre` and `#:post` conditions. `define/contract` establishes a contract boundary. Blame tracking identifies which party violated the contract.


<a id="orgc8a8289"></a>

### Composability Patterns

-   The Specification Pattern (Fowler) composes predicates via AND/OR/NOT combinators.
-   The "schema explosion" problem occurs when specs grow combinatorially. Solution: keep specs *open* (new keys without modifying existing specs) and *compositional* (specs combine via simple operations). Clojure handles this via `s/merge` and `s/and`.


<a id="orga8eec11"></a>

### Koka Effect Aliases

Koka's `alias pure = <div,exn>` abbreviates a row of effects. This demonstrates the general principle: named groupings of constraints improve readability. Prologos's `bundle` already does this for trait constraints; `property` will do this for propositions; `functor` will do this for type structure.


<a id="org3924458"></a>

### Insight for Prologos

The map argument to `spec` is inherently open and composable. New keys can be added in future versions without breaking existing code. Unrecognized keys are stored but not acted upon (*Postel principle*: liberal in what you accept, conservative in what you emit). Spec metadata should be first-class data (homoiconicity principle) &#x2014; quotable, inspectable, transformable.


<a id="org970d5c2"></a>

## 7. Type Abbreviation Mechanisms (Cross-Language Survey)


<a id="org2537f81"></a>

### Transparent Aliases

Haskell `type`, Rust `type`, Koka `alias`. Fully expanded before type checking; zero impact on inference. Haskell's limitation: type synonyms cannot be partially applied. Rust and Koka do not share this restriction.


<a id="orgb6caade"></a>

### Opaque / Controlled-Reducibility Aliases

Lean 4's `abbrev` (reducible, instances carry through) vs `def` (semireducible, opaque to instance search). Scala 3's `opaque type` (transparent inside defining scope, opaque outside). Haskell's `newtype` (distinct type, zero-cost at runtime).


<a id="orga8b3261"></a>

### Module-Level Abstraction

OCaml modules control type visibility through signatures: same `type t = int` can be exposed transparently or abstractly depending on the `.mli` file. 1ML (Rossberg) unifies core and module language so type abbreviations are ordinary first-class functions.


<a id="org2219973"></a>

### Insight for Prologos

The `functor` keyword (Part VII) takes the Lean `abbrev` approach &#x2014; transparent by default, with the added richness of category-theoretic metadata. Unlike bare abbreviations, a `functor` declares what the type *means* through its operations, not just what it expands to.


<a id="org099cdbb"></a>

# Part II: Syntax Design


<a id="org80983aa"></a>

## Current Spec Syntax

```prologos
;; Basic:
spec add Nat Nat -> Nat

;; With implicit binders:
spec id {A : Type} A -> A

;; With trait constraints (where clause):
spec sort {A : Type} [List A] -> [List A] where (Ord A)

;; With inline constraints:
spec elem {A} [Eq A] A [List A] -> Bool

;; Multi-arity:
spec zip
  | {A B : Type} [List A] [List B] -> [List [Pair A B]]
  | {A B C : Type} [A -> B -> C] [List A] [List B] -> [List C]
```

The `spec-entry` struct (macros.rkt line 203) stores: `type-datums`, `docstring`, `multi?`, `srcloc`, `where-constraints`, `implicit-binders`, `rest-type`.


<a id="orgd76f920"></a>

## Extended Spec Syntax

The extension uses Prologos's existing implicit map syntax. Keyword-headed children after the type signature are collected into a metadata map:

```prologos
spec sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :doc "Sorts a list in ascending order using merge sort"
  :examples
    - [sort '[3N 1N 2N]] => '[1N 2N 3N]
    - [sort '[]] => '[]
  :properties (sortable-laws A)
  :see-also [reverse filter]
```


<a id="org51673c8"></a>

### The `:implicits` Key

The `:implicits` key lifts implicit binders out of the type signature into metadata, freeing the signature to express pure function shape:

```prologos
;; Current (inline implicits):
spec gmap {A B : Type} {C : Type -> Type} (Seqable C) -> (Buildable C) -> [A -> B] -> [C A] -> [C B]

;; With :implicits + :where:
spec gmap [A -> B] -> [C A] -> [C B]
  :implicits {A B : Type} {C : Type -> Type}
  :where (Seqable C) (Buildable C)
```

All three forms coexist:

1.  Inline `{A : Type}` &#x2014; for quick one-liners
2.  `:implicits` key &#x2014; for clean multi-line specs
3.  Omitted entirely &#x2014; when inference handles it (already works for kind `Type`)

**Implementation**: In `process-spec`, extract `:implicits` from the metadata map and merge with any inline `{...}` binders. The `extract-implicit-binders` function already returns `(values implicit-binders remaining-tokens)` &#x2014; union the two sources. Duplicate binders (same name in both) emit a warning and deduplicate.
