docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsubsection{Multi-Arity Specs with Metadata}
\label{sec:orgbdade3f}

\textbf{Decision}: metadata is function-level (shared across all arities). Each \texttt{|}
branch defines its own type; the metadata applies to the function as a whole.

\begin{verbatim}
spec greet
  | Nat -> String
  | String Nat -> String
  :doc "Greet someone"
  :examples
    - [greet 42N] => "hello 42"
    - [greet "world" 3N] => "hello world world world"
  :properties
    - :name "greet-nat-positive"
      :forall {n : Nat}
      :holds [str-length [greet n] > 0N]
\end{verbatim}

Rationale: properties have \texttt{:forall} binders whose types determine which
branch they exercise. Examples are concrete calls whose argument types
determine dispatch. Per-branch metadata is theoretically more precise but
practically redundant --- the types already carry the dispatch information.
\subsubsection{Sexp Mode Equivalent}
\label{sec:org0e1cc49}

\begin{verbatim}
(spec sort [List A] -> [List A]
  (:implicits {A : Type})
  (:where (Ord A))
  (:doc "Sorts a list in ascending order using merge sort")
  (:examples (([sort '[3N 1N 2N]] => [1N 2N 3N])
              ([sort '[]] => [])))
  (:properties (sortable-laws A)))
\end{verbatim}
\subsubsection{How Parsing Works}
\label{sec:org05fda01}

\begin{enumerate}
\item The WS reader produces the outer form with keyword-headed children as nested
s-expressions.

\item \texttt{rewrite-implicit-map} (macros.rkt line 2452) is extended to recognize \texttt{spec}
as a trigger head alongside \texttt{def\textasciitilde{}/\textasciitilde{}defn}. The function detects keyword-headed
children \emph{after} the type signature and wraps them into a \texttt{\$brace-params}
(map literal) node.

\item \texttt{process-spec} (macros.rkt line 1314) is extended to look for a trailing map
after extracting the type signature. Recognized keys are extracted; the entire
map is stored in a new \texttt{metadata} field on \texttt{spec-entry}.

\item Backward compatibility: specs without keyword children parse identically to
today. The existing positional \texttt{where} keyword still works; \texttt{:where} in the
map augments it (union of both constraint sets).
\end{enumerate}
\subsection{Supported Keys}
\label{sec:org6df9fa7}

\subsubsection{Phase 1 (Near-term: syntax + storage)}
\label{sec:org3643dee}

\begin{center}
\begin{tabular}{lll}
Key & Type & Semantics\\
\hline
\texttt{:implicits} & \texttt{(listof brace-param-group)} & Implicit type binders (moved from inline)\\
\texttt{:where} & \texttt{(listof constraint)} & Trait constraints (migrated from positional)\\
\texttt{:doc} & \texttt{string} & Documentation string\\
\texttt{:examples} & \texttt{(listof (datum => datum))} & Input/output pairs for auto-test generation\\
\texttt{:see-also} & \texttt{(listof symbol)} & Cross-references to related specs\\
\texttt{:since} & \texttt{string} & Version/date introduced\\
\texttt{:deprecated} & \texttt{string} or \texttt{\#t} & Deprecation notice\\
\end{tabular}
\end{center}
\subsubsection{Phase 2 (Medium-term: property checking)}
\label{sec:org0add3e9}

\begin{center}
\begin{tabular}{lll}
Key & Type & Semantics\\
\hline
\texttt{:properties} & \texttt{(listof property-ref)} & Property references or inline property clauses\\
\texttt{:pre} & \texttt{datum} (args -> Bool) & Precondition (contract on arguments)\\
\texttt{:post} & \texttt{datum} (args ret -> Bool) & Postcondition (contract on return)\\
\texttt{:invariant} & \texttt{datum} (\{args ret\} -> Bool) & Relation between args and return (Clojure \texttt{:fn})\\
\end{tabular}
\end{center}
\subsubsection{Phase 3 (Long-term: verification)}
\label{sec:org03776c9}

\begin{center}
\begin{tabular}{lll}
Key & Type & Semantics\\
\hline
\texttt{:refines} & \texttt{datum} (result -> Bool) & Refinement predicate, compiles to Sigma type\\
\texttt{:measure} & \texttt{datum} (args -> Nat) & Termination measure for recursion\\
\texttt{:decreases} & \texttt{symbol} or \texttt{datum} & What decreases on recursive calls\\
\texttt{:proof} & \texttt{datum} or \texttt{:auto} & Proof strategy hint for verification\\
\end{tabular}
\end{center}
\subsection{Mapping Spec Keys to Dependent Types}
\label{sec:org5069bc2}

This is the deep theoretical connection between spec metadata and Prologos's
type system. Every metadata key has a \emph{type-theoretic interpretation}.
\subsubsection{Properties as Dependent Types}
\label{sec:orgf369ca8}

A property "for all x : Nat, add x 0 = x" is a Pi type:

\begin{verbatim}
;; The property:
:properties
  - :name "right-identity"
    :forall {x : Nat}
    :holds [eq? [add x 0N] x]

;; Corresponds to the dependent type:
;; <(x : Nat) -> [Eq Nat [add x 0N] x]>
;; A function from any Nat to a proof of equality
\end{verbatim}
\subsubsection{Preconditions as Refined Arguments}
\label{sec:org43938ab}

\begin{verbatim}
;; The contract:
spec divide Int Int -> Int
  :pre (fn [x y] [not [eq? y 0]])

;; Maps to the dependent type:
;; <(x : Int) -> (y : Int) -> [Not [Eq Int y 0]] -> Int>
;; Third argument is a proof that y /= 0
\end{verbatim}
\subsubsection{Postconditions as Refined Return Types}
\label{sec:org96f074c}

\begin{verbatim}
;; The contract:
spec abs Int -> Int
  :post (fn [x result] [>= result 0])

;; Maps to:
;; <(x : Int) -> <(result : Int) * [GTE result 0]>>
;; Return type is a Sigma pair: the result AND a proof it's non-negative
\end{verbatim}
