docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.md


<a id="org25d9b92"></a>

### Multi-Arity Specs with Metadata

**Decision**: metadata is function-level (shared across all arities). Each `|` branch defines its own type; the metadata applies to the function as a whole.

```prologos
spec greet
  | Nat -> String
  | String Nat -> String
  :doc "Greet someone"
  :examples
    - [greet 42N] => "hello 42"
    - [greet "world" 3N] => "hello world world world"
  :properties
    - :name "greet-nat-positive"
      :forall {n : Nat}
      :holds [str-length [greet n] > 0N]
```

Rationale: properties have `:forall` binders whose types determine which branch they exercise. Examples are concrete calls whose argument types determine dispatch. Per-branch metadata is theoretically more precise but practically redundant &#x2014; the types already carry the dispatch information.


<a id="org7e9d5fc"></a>

### Sexp Mode Equivalent

```racket
(spec sort [List A] -> [List A]
  (:implicits {A : Type})
  (:where (Ord A))
  (:doc "Sorts a list in ascending order using merge sort")
  (:examples (([sort '[3N 1N 2N]] => [1N 2N 3N])
              ([sort '[]] => [])))
  (:properties (sortable-laws A)))
```


<a id="org841bcdd"></a>

### How Parsing Works

1.  The WS reader produces the outer form with keyword-headed children as nested s-expressions.

2.  `rewrite-implicit-map` (macros.rkt line 2452) is extended to recognize `spec` as a trigger head alongside `def~/~defn`. The function detects keyword-headed children *after* the type signature and wraps them into a `$brace-params` (map literal) node.

3.  `process-spec` (macros.rkt line 1314) is extended to look for a trailing map after extracting the type signature. Recognized keys are extracted; the entire map is stored in a new `metadata` field on `spec-entry`.

4.  Backward compatibility: specs without keyword children parse identically to today. The existing positional `where` keyword still works; `:where` in the map augments it (union of both constraint sets).


<a id="orgc9e08a7"></a>

## Supported Keys


<a id="org11d569b"></a>

### Phase 1 (Near-term: syntax + storage)

| Key           | Type                         | Semantics                                    |
|------------- |---------------------------- |-------------------------------------------- |
| `:implicits`  | `(listof brace-param-group)` | Implicit type binders (moved from inline)    |
| `:where`      | `(listof constraint)`        | Trait constraints (migrated from positional) |
| `:doc`        | `string`                     | Documentation string                         |
| `:examples`   | `(listof (datum => datum))`  | Input/output pairs for auto-test generation  |
| `:see-also`   | `(listof symbol)`            | Cross-references to related specs            |
| `:since`      | `string`                     | Version/date introduced                      |
| `:deprecated` | `string` or `#t`             | Deprecation notice                           |


<a id="org708a647"></a>

### Phase 2 (Medium-term: property checking)

| Key           | Type                         | Semantics                                        |
|------------- |---------------------------- |------------------------------------------------ |
| `:properties` | `(listof property-ref)`      | Property references or inline property clauses   |
| `:pre`        | `datum` (args -> Bool)       | Precondition (contract on arguments)             |
| `:post`       | `datum` (args ret -> Bool)   | Postcondition (contract on return)               |
| `:invariant`  | `datum` ({args ret} -> Bool) | Relation between args and return (Clojure `:fn`) |


<a id="orge5efdf7"></a>

### Phase 3 (Long-term: verification)

| Key          | Type                     | Semantics                                    |
|------------ |------------------------ |-------------------------------------------- |
| `:refines`   | `datum` (result -> Bool) | Refinement predicate, compiles to Sigma type |
| `:measure`   | `datum` (args -> Nat)    | Termination measure for recursion            |
| `:decreases` | `symbol` or `datum`      | What decreases on recursive calls            |
| `:proof`     | `datum` or `:auto`       | Proof strategy hint for verification         |


<a id="org873c93c"></a>

## Mapping Spec Keys to Dependent Types

This is the deep theoretical connection between spec metadata and Prologos's type system. Every metadata key has a *type-theoretic interpretation*.


<a id="orga1e91e1"></a>

### Properties as Dependent Types

A property "for all x : Nat, add x 0 = x" is a Pi type:

```prologos
;; The property:
:properties
  - :name "right-identity"
    :forall {x : Nat}
    :holds [eq? [add x 0N] x]

;; Corresponds to the dependent type:
;; <(x : Nat) -> [Eq Nat [add x 0N] x]>
;; A function from any Nat to a proof of equality
```


<a id="orgfb15cb3"></a>

### Preconditions as Refined Arguments

```prologos
;; The contract:
spec divide Int Int -> Int
  :pre (fn [x y] [not [eq? y 0]])

;; Maps to the dependent type:
;; <(x : Int) -> (y : Int) -> [Not [Eq Int y 0]] -> Int>
;; Third argument is a proof that y /= 0
```


<a id="orgb3ed5c4"></a>

### Postconditions as Refined Return Types

```prologos
;; The contract:
spec abs Int -> Int
  :post (fn [x result] [>= result 0])

;; Maps to:
;; <(x : Int) -> <(result : Int) * [GTE result 0]>>
;; Return type is a Sigma pair: the result AND a proof it's non-negative
```
