docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.org
*** Invariants as Dependent Function Types

#+begin_src prologos
;; Clojure spec's :fn relation:
spec ranged-rand Int Int -> Int
  :invariant (fn [start end result]
    [and [>= result start] [< result end]])

;; Maps to:
;; <(start : Int) -> (end : Int) -> {v : Int | v >= start, v < end}>
#+end_src

*** The Graduation Path

The key design insight: /the same spec syntax upgrades from testing to proving
without modification/. At Phase 2, properties/contracts are runtime checks
(QuickCheck generators from types, contract wrappers at call boundaries). At
Phase 3, the same properties become proof obligations that the type checker
verifies statically. The syntax is identical; the verification backend upgrades.

| Phase | =:properties= | =:pre= / =:post= | =:refines= |
|-------+---------------------+--------------------+----------------------|
| 2 | Runtime QuickCheck | Runtime contracts | Runtime assertion |
| 3 | Proof obligation | Refined Pi type | Sigma compilation |

* Part III: Typed Holes (=??=)

** Motivation

Agda and Idris demonstrate that /holes/ are the foundation of interactive
development in dependently-typed languages. The programmer writes what they know,
marks what they don't with a hole, and the type system reports what's needed.

Prologos already has ~_~ (inference hole / wildcard), which means "infer this
for me automatically." The ~??~ typed hole means something fundamentally
different: "I don't know what goes here --- show me what's possible."

** Syntax

#+begin_src prologos
;; Unnamed hole:
defn reverse
  | [nil]        -> nil
  | [[cons h t]] -> ??

;; Named hole:
defn zip-with [f xs ys]
  match [xs ys]
    | [nil _]              -> nil
    | [_ nil]              -> nil
    | [[cons x xs'] [cons y ys']] -> [cons ??combine ??recurse]
#+end_src

*** Reader

The WS reader recognizes ~??~ (and ~??identifier~) as a token type
~'typed-hole~. The form-builder emits ~($typed-hole)~ or ~($typed-hole name)~
sentinel. The parser converts this to ~expr-typed-hole~ (new AST node).

*** Distinction from ~_~

| Feature | ~_~ (inference hole) | ~??~ (typed hole) |
|---------+--------------------------+--------------------------|
| Intent | "Infer this for me" | "Help me fill this in" |
| Behavior | Silent, automatic | Interactive, diagnostic |
| Output | Resolved type/value | Hole report to editor |
| Use case | Type inference | Development workflow |

*** Hole Report

When the type checker encounters ~expr-typed-hole~, it produces a diagnostic
(not an error) containing:

#+begin_example
Hole ??combine : [List A]
Context:
  x  : A
  xs' : [List A]
  y  : B
  ys' : [List B]
  f  : A -> B -> C
  zip-with : [A -> B -> C] -> [List A] -> [List B] -> [List C]
Suggestions:
  [f x y]            -- from applying f to available arguments
  [cons [f x y] ...]  -- from matching the expected List type
#+end_example

The editor protocol (future work) would transmit this as structured data.

** "The What?What?" Interaction Model

The envisioned workflow:

1. Write ~spec~ with type signature, properties, examples
2. Write ~defn~ skeleton with ~??~ holes for unknown parts
3. Press key command --- the type system reports what each hole needs
4. Select a suggestion or refine manually
5. Repeat until all holes are filled and properties hold

This is fundamentally the Agda/Idris interaction model, but using Prologos's
structured spec metadata to provide richer suggestions (e.g., if a property says
the function is commutative, the case-split suggestions can leverage that).

* Part IV: The ~property~ Keyword

** Motivation

Many functions share the same properties. Sorting functions are idempotent.
Monoids have identity and associativity. Functors preserve composition. Writing
these properties inline on every ~spec~ is repetitive and error-prone.

The ~property~ keyword provides reusable, composable proposition groups ---
analogous to ~bundle~ for traits. The parallel is exact:

| Concept | For methods | For propositions |
|---------+-------------+------------------|
| Single declaration | ~trait~ | individual ~:holds~ clause |
| Named group | ~bundle~ | ~property~ |
| Composition | ~bundle~ includes traits/bundles | ~property~ includes properties |
| Attachment to spec | ~:where (Ord A)~ | ~:properties (sortable-laws A)~ |
| Attachment to trait | (implicit) | ~:laws (functor-laws F)~ |

** Syntax

