docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsubsection{Invariants as Dependent Function Types}
\label{sec:org39e4f41}

\begin{verbatim}
;; Clojure spec's :fn relation:
spec ranged-rand Int Int -> Int
  :invariant (fn [start end result]
    [and [>= result start] [< result end]])

;; Maps to:
;; <(start : Int) -> (end : Int) -> {v : Int | v >= start, v < end}>
\end{verbatim}
\subsubsection{The Graduation Path}
\label{sec:orge6b6e58}

The key design insight: \emph{the same spec syntax upgrades from testing to proving
without modification}. At Phase 2, properties/contracts are runtime checks
(QuickCheck generators from types, contract wrappers at call boundaries). At
Phase 3, the same properties become proof obligations that the type checker
verifies statically. The syntax is identical; the verification backend upgrades.

\begin{center}
\begin{tabular}{rlll}
Phase & \texttt{:properties} & \texttt{:pre} / \texttt{:post} & \texttt{:refines}\\
\hline
2 & Runtime QuickCheck & Runtime contracts & Runtime assertion\\
3 & Proof obligation & Refined Pi type & Sigma compilation\\
\end{tabular}
\end{center}
\section{Part III: Typed Holes (\texttt{??})}
\label{sec:orga27a4ca}

\subsection{Motivation}
\label{sec:org8ee21f8}

Agda and Idris demonstrate that \emph{holes} are the foundation of interactive
development in dependently-typed languages. The programmer writes what they know,
marks what they don't with a hole, and the type system reports what's needed.

Prologos already has \texttt{\_} (inference hole / wildcard), which means "infer this
for me automatically." The \texttt{??} typed hole means something fundamentally
different: "I don't know what goes here --- show me what's possible."
\subsection{Syntax}
\label{sec:org9947416}

\begin{verbatim}
;; Unnamed hole:
defn reverse
  | [nil]        -> nil
  | [[cons h t]] -> ??

;; Named hole:
defn zip-with [f xs ys]
  match [xs ys]
    | [nil _]              -> nil
    | [_ nil]              -> nil
    | [[cons x xs'] [cons y ys']] -> [cons ??combine ??recurse]
\end{verbatim}
\subsubsection{Reader}
\label{sec:org2a8b72a}

The WS reader recognizes \texttt{??} (and \texttt{??identifier}) as a token type
\texttt{'typed-hole}. The form-builder emits \texttt{(\$typed-hole)} or \texttt{(\$typed-hole name)}
sentinel. The parser converts this to \texttt{expr-typed-hole} (new AST node).
\subsubsection{Distinction from \texttt{\_}}
\label{sec:orgf283c31}

\begin{center}
\begin{tabular}{lll}
Feature & \texttt{\_} (inference hole) & \texttt{??} (typed hole)\\
\hline
Intent & "Infer this for me" & "Help me fill this in"\\
Behavior & Silent, automatic & Interactive, diagnostic\\
Output & Resolved type/value & Hole report to editor\\
Use case & Type inference & Development workflow\\
\end{tabular}
\end{center}
\subsubsection{Hole Report}
\label{sec:orge5242be}

When the type checker encounters \texttt{expr-typed-hole}, it produces a diagnostic
(not an error) containing:

\begin{verbatim}
Hole ??combine : [List A]
Context:
  x  : A
  xs' : [List A]
  y  : B
  ys' : [List B]
  f  : A -> B -> C
  zip-with : [A -> B -> C] -> [List A] -> [List B] -> [List C]
Suggestions:
  [f x y]            -- from applying f to available arguments
  [cons [f x y] ...]  -- from matching the expected List type
\end{verbatim}

The editor protocol (future work) would transmit this as structured data.
\subsection{"The What?What?" Interaction Model}
\label{sec:org01d7ed4}

The envisioned workflow:

\begin{enumerate}
\item Write \texttt{spec} with type signature, properties, examples
\item Write \texttt{defn} skeleton with \texttt{??} holes for unknown parts
\item Press key command --- the type system reports what each hole needs
\item Select a suggestion or refine manually
\item Repeat until all holes are filled and properties hold
\end{enumerate}

This is fundamentally the Agda/Idris interaction model, but using Prologos's
structured spec metadata to provide richer suggestions (e.g., if a property says
the function is commutative, the case-split suggestions can leverage that).
\section{Part IV: The \texttt{property} Keyword}
\label{sec:org0e1a952}

\subsection{Motivation}
\label{sec:org4772d74}

Many functions share the same properties. Sorting functions are idempotent.
Monoids have identity and associativity. Functors preserve composition. Writing
these properties inline on every \texttt{spec} is repetitive and error-prone.

The \texttt{property} keyword provides reusable, composable proposition groups ---
analogous to \texttt{bundle} for traits. The parallel is exact:

\begin{center}
\begin{tabular}{lll}
Concept & For methods & For propositions\\
\hline
Single declaration & \texttt{trait} & individual \texttt{:holds} clause\\
Named group & \texttt{bundle} & \texttt{property}\\
Composition & \texttt{bundle} includes traits/bundles & \texttt{property} includes properties\\
Attachment to spec & \texttt{:where (Ord A)} & \texttt{:properties (sortable-laws A)}\\
Attachment to trait & (implicit) & \texttt{:laws (functor-laws F)}\\
\end{tabular}
\end{center}
