docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.org
*** Basic Declaration

#+begin_src prologos
property sortable-laws {A : Type}
  :where (Ord A)
  - :name "idempotent"
    :forall {xs : [List A]}
    :holds [eq? [sort [sort xs]] [sort xs]]
  - :name "length-preserving"
    :forall {xs : [List A]}
    :holds [eq? [length [sort xs]] [length xs]]
  - :name "ordered-output"
    :forall {xs : [List A]}
    :holds [sorted? [sort xs]]
#+end_src

A ~property~ is a named, parameterized conjunction of propositions. Each clause
is a universally quantified boolean assertion. The ~:where~ constrains what
types the property is meaningful for.

*** Usage in ~spec~

#+begin_src prologos
spec sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :properties (sortable-laws A)
#+end_src

The ~(sortable-laws A)~ reference is like ~(Ord A)~ in a ~:where~ --- a named
requirement, parameterized by type variables from the spec.

** Composition via ~:includes~

Properties compose via conjunction, paralleling ~bundle~:

#+begin_src prologos
property semigroup-laws {A : Type}
  :where (Add A)
  - :name "associativity"
    :forall {x y z : A}
    :holds [eq? [add [add x y] z] [add x [add y z]]]

property monoid-laws {A : Type}
  :where (Add A) (AdditiveIdentity A)
  :includes (semigroup-laws A)
  - :name "left-identity"
    :forall {x : A}
    :holds [eq? [add additive-identity x] x]
  - :name "right-identity"
    :forall {x : A}
    :holds [eq? [add x additive-identity] x]

property group-laws {A : Type}
  :where (Add A) (AdditiveIdentity A) (Neg A)
  :includes (monoid-laws A)
  - :name "left-inverse"
    :forall {x : A}
    :holds [eq? [add [neg x] x] additive-identity]
  - :name "right-inverse"
    :forall {x : A}
    :holds [eq? [add x [neg x]] additive-identity]
#+end_src

~group-laws~ includes ~monoid-laws~ which includes ~semigroup-laws~. Flattened:
~group-laws~ is the conjunction of all six properties.

** The Logic Programming Reading

From the sequent calculus perspective:

#+begin_example
property P {A} :where (C₁ A) (C₂ A) :includes (Q A) =
  Γ, C₁(A), C₂(A) ⊢ Q(A) ∧ p₁(A) ∧ p₂(A) ∧ ...
#+end_example

Each ~:holds~ clause is a proposition. ~:includes~ is conjunction. The whole
~property~ is a universally quantified sequent: "for all A satisfying C₁ and C₂,
the conjunction of all these propositions holds."

When attached to a spec with ~:properties (P A)~, you assert that your
implementation satisfies that sequent. At Phase 2 (QuickCheck), each conjunct
becomes a test. At Phase 3 (verification), each conjunct becomes a proof
obligation.

The composability is clean because conjunction is associative and commutative ---
the order and nesting of ~:includes~ don't matter; the result is always a flat
set of propositions.

** Parameterized Properties (Higher-Order)

Properties can be parameterized over functions, not just types:

#+begin_src prologos
;; Properties about ANY sorting function
property sorting-properties {A : Type} {f : [List A] -> [List A]}
  :where (Ord A)
  - :name "idempotent"
    :forall {xs : [List A]}
    :holds [eq? [f [f xs]] [f xs]]
  - :name "permutation"
    :forall {xs : [List A]}
    :holds [same-elements? xs [f xs]]
  - :name "ordered"
    :forall {xs : [List A]}
    :holds [sorted? [f xs]]

;; Attach to multiple implementations:
spec sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :properties (sorting-properties A sort)

spec merge-sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :properties (sorting-properties A merge-sort)
#+end_src

Define the contract once, attach it to any implementation.

** ~:laws~ on Traits

A trait can reference its laws:

#+begin_src prologos
property functor-laws {F : Type -> Type}
  :where (Functor F)
  - :name "identity"
    :forall {xs : [F A]}
    :holds [eq? [fmap id xs] xs]
  - :name "composition"
    :forall {f : [A -> B]} {g : [B -> C]} {xs : [F A]}
    :holds [eq? [fmap [>> f g] xs] [fmap g [fmap f xs]]]

trait Functor {F : Type -> Type}
  :laws (functor-laws F)
  spec fmap {A B : Type} [A -> B] -> [F A] -> [F B]
#+end_src

~:laws~ says "any instance of this trait is expected to satisfy these
properties." When you write ~instance Functor List~, the system knows to check
~(functor-laws List)~. At Phase 2: generate ~List~-specialized QuickCheck tests.
At Phase 3: proof obligations.

** Hierarchical Laws (Functor → Applicative → Monad)

#+begin_src prologos
property applicative-laws {F : Type -> Type}
  :where (Applicative F)
  :includes (functor-laws F)
  - :name "identity"
    :forall {xs : [F A]}
    :holds [eq? [ap [pure id] xs] xs]
  - :name "homomorphism"
    :forall {f : [A -> B]} {x : A}
    :holds [eq? [ap [pure f] [pure x]] [pure [f x]]]

property monad-laws {M : Type -> Type}
  :where (Monad M)
  :includes (applicative-laws M)
  - :name "left-identity"
    :forall {a : A} {f : [A -> [M B]]}
    :holds [eq? [bind [pure a] f] [f a]]
  - :name "right-identity"
    :forall {ma : [M A]}
    :holds [eq? [bind ma pure] ma]
  - :name "associativity"
    :forall {ma : [M A]} {f : [A -> [M B]]} {g : [B -> [M C]]}
    :holds [eq? [bind [bind ma f] g] [bind ma [fn [a] [bind [f a] g]]]]
#+end_src

