docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsection{Syntax}
\label{sec:org81e4d5a}

\subsubsection{Basic Declaration}
\label{sec:org1de4fc8}

\begin{verbatim}
property sortable-laws {A : Type}
  :where (Ord A)
  - :name "idempotent"
    :forall {xs : [List A]}
    :holds [eq? [sort [sort xs]] [sort xs]]
  - :name "length-preserving"
    :forall {xs : [List A]}
    :holds [eq? [length [sort xs]] [length xs]]
  - :name "ordered-output"
    :forall {xs : [List A]}
    :holds [sorted? [sort xs]]
\end{verbatim}

A \texttt{property} is a named, parameterized conjunction of propositions. Each clause
is a universally quantified boolean assertion. The \texttt{:where} constrains what
types the property is meaningful for.
\subsubsection{Usage in \texttt{spec}}
\label{sec:orgfc98e01}

\begin{verbatim}
spec sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :properties (sortable-laws A)
\end{verbatim}

The \texttt{(sortable-laws A)} reference is like \texttt{(Ord A)} in a \texttt{:where} --- a named
requirement, parameterized by type variables from the spec.
\subsection{Composition via \texttt{:includes}}
\label{sec:org95991e5}

Properties compose via conjunction, paralleling \texttt{bundle}:

\begin{verbatim}
property semigroup-laws {A : Type}
  :where (Add A)
  - :name "associativity"
    :forall {x y z : A}
    :holds [eq? [add [add x y] z] [add x [add y z]]]

property monoid-laws {A : Type}
  :where (Add A) (AdditiveIdentity A)
  :includes (semigroup-laws A)
  - :name "left-identity"
    :forall {x : A}
    :holds [eq? [add additive-identity x] x]
  - :name "right-identity"
    :forall {x : A}
    :holds [eq? [add x additive-identity] x]

property group-laws {A : Type}
  :where (Add A) (AdditiveIdentity A) (Neg A)
  :includes (monoid-laws A)
  - :name "left-inverse"
    :forall {x : A}
    :holds [eq? [add [neg x] x] additive-identity]
  - :name "right-inverse"
    :forall {x : A}
    :holds [eq? [add x [neg x]] additive-identity]
\end{verbatim}

\texttt{group-laws} includes \texttt{monoid-laws} which includes \texttt{semigroup-laws}. Flattened:
\texttt{group-laws} is the conjunction of all six properties.
\subsection{The Logic Programming Reading}
\label{sec:org3c61716}

From the sequent calculus perspective:

\begin{verbatim}
property P {A} :where (C₁ A) (C₂ A) :includes (Q A) =
  Γ, C₁(A), C₂(A) ⊢ Q(A) ∧ p₁(A) ∧ p₂(A) ∧ ...
\end{verbatim}

Each \texttt{:holds} clause is a proposition. \texttt{:includes} is conjunction. The whole
\texttt{property} is a universally quantified sequent: "for all A satisfying C₁ and C₂,
the conjunction of all these propositions holds."

When attached to a spec with \texttt{:properties (P A)}, you assert that your
implementation satisfies that sequent. At Phase 2 (QuickCheck), each conjunct
becomes a test. At Phase 3 (verification), each conjunct becomes a proof
obligation.

The composability is clean because conjunction is associative and commutative ---
the order and nesting of \texttt{:includes} don't matter; the result is always a flat
set of propositions.
\subsection{Parameterized Properties (Higher-Order)}
\label{sec:org04619f5}

Properties can be parameterized over functions, not just types:

\begin{verbatim}
;; Properties about ANY sorting function
property sorting-properties {A : Type} {f : [List A] -> [List A]}
  :where (Ord A)
  - :name "idempotent"
    :forall {xs : [List A]}
    :holds [eq? [f [f xs]] [f xs]]
  - :name "permutation"
    :forall {xs : [List A]}
    :holds [same-elements? xs [f xs]]
  - :name "ordered"
    :forall {xs : [List A]}
    :holds [sorted? [f xs]]

;; Attach to multiple implementations:
spec sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :properties (sorting-properties A sort)

spec merge-sort [List A] -> [List A]
  :implicits {A : Type}
  :where (Ord A)
  :properties (sorting-properties A merge-sort)
\end{verbatim}

Define the contract once, attach it to any implementation.
\subsection{\texttt{:laws} on Traits}
\label{sec:org2a67970}

A trait can reference its laws:

\begin{verbatim}
property functor-laws {F : Type -> Type}
  :where (Functor F)
  - :name "identity"
    :forall {xs : [F A]}
    :holds [eq? [fmap id xs] xs]
  - :name "composition"
    :forall {f : [A -> B]} {g : [B -> C]} {xs : [F A]}
    :holds [eq? [fmap [>> f g] xs] [fmap g [fmap f xs]]]

trait Functor {F : Type -> Type}
  :laws (functor-laws F)
  spec fmap {A B : Type} [A -> B] -> [F A] -> [F B]
\end{verbatim}

\texttt{:laws} says "any instance of this trait is expected to satisfy these
properties." When you write \texttt{instance Functor List}, the system knows to check
\texttt{(functor-laws List)}. At Phase 2: generate \texttt{List}-specialized QuickCheck tests.
At Phase 3: proof obligations.
\subsection{Hierarchical Laws (Functor → Applicative → Monad)}
\label{sec:org56b910a}

\begin{verbatim}
property applicative-laws {F : Type -> Type}
  :where (Applicative F)
  :includes (functor-laws F)
  - :name "identity"
    :forall {xs : [F A]}
    :holds [eq? [ap [pure id] xs] xs]
  - :name "homomorphism"
    :forall {f : [A -> B]} {x : A}
    :holds [eq? [ap [pure f] [pure x]] [pure [f x]]]

property monad-laws {M : Type -> Type}
  :where (Monad M)
  :includes (applicative-laws M)
  - :name "left-identity"
    :forall {a : A} {f : [A -> [M B]]}
    :holds [eq? [bind [pure a] f] [f a]]
  - :name "right-identity"
    :forall {ma : [M A]}
    :holds [eq? [bind ma pure] ma]
  - :name "associativity"
    :forall {ma : [M A]} {f : [A -> [M B]]} {g : [B -> [M C]]}
    :holds [eq? [bind [bind ma f] g] [bind ma [fn [a] [bind [f a] g]]]]
\end{verbatim}
