docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.org
** Name Scoping in ~:includes~

When ~monad-laws~ includes ~applicative-laws~ which includes ~functor-laws~,
and both ~monad-laws~ and ~functor-laws~ define a property named ~"identity"~:
names are scoped to their declaring ~property~ block.

Flattened property names use ~/~ qualification:
~functor-laws/identity~, ~applicative-laws/identity~, ~monad-laws/left-identity~.

This parallels how trait methods are scoped to their trait.

** The Symmetry

#+begin_example
trait     : Type → Set of method signatures     (what you must implement)
bundle    : conjunction of traits                (shorthand for multiple traits)
property  : Type → Set of propositions           (what must be true)
  includes: conjunction of properties            (shorthand for multiple properties)

spec      : function → type + metadata
  :where  : trait constraints                    (what the types must support)
  :properties : property constraints             (what the function must satisfy)

instance  : Type → method implementations        (how you implement)
  (auto)  : Type → property evidence             (how you prove / test)
#+end_example

Traits say what operations exist. Properties say what laws they obey. Today only
the first is checked; this design gives us a path to checking the second.

* Part V: Expressing Higher-Kinded Pi Types Ergonomically

** The Problem

Complex higher-kinded and higher-rank types are unreadable:

#+begin_src prologos
;; Current xf-compose signature:
spec xf-compose {A B C : Type} <(S :0 Type) -> [S -> B -> S] -> S -> A -> S> <(S :0 Type) -> [S -> C -> S] -> S -> B -> S> -> <(S :0 Type) -> [S -> C -> S] -> S -> A -> S>
#+end_src

The transducer module already identifies the abstraction in a comment:
~Type: Xf A B = forall R. (R -> B -> R) -> (R -> A -> R)~. With the right name,
the signature becomes: ~[Xf A B] -> [Xf B C] -> [Xf A C]~ --- category-theoretic
composition, instantly readable.

** Progressive Complexity Levels

*** Level 0: No types (inference only)

#+begin_src prologos
defn add [x y] [nat-add x y]
#+end_src

*** Level 1: Simple spec (monomorphic)

#+begin_src prologos
spec add Nat Nat -> Nat
defn add [x y] [nat-add x y]
#+end_src

*** Level 2: Polymorphic spec

#+begin_src prologos
spec id A -> A
defn id [x] x
#+end_src

(~{A : Type}~ inferred from ~A~ appearing free in signature)

*** Level 3: Constrained polymorphism

#+begin_src prologos
spec sort [List A] -> [List A]
  :where (Ord A)
defn sort [xs] ...
#+end_src

*** Level 4: Higher-kinded polymorphism

#+begin_src prologos
spec fmap [A -> B] -> [F A] -> [F B]
  :where (Functor F)
  :doc "Apply a function inside a functor"
  :properties (functor-laws F)
defn fmap [f xs] ...
#+end_src

(~{A B : Type}~ inferred; ~{F : Type -> Type}~ inferred from ~(Functor F)~
where clause --- the trait declares the kind)

*** Level 5: Named type abstractions (functor)

#+begin_src prologos
spec xf-compose [Xf A B] -> [Xf B C] -> [Xf A C]
  :implicits {A B C : Type}
  :properties (transducer-fusion-laws A B C)
#+end_src

(~Xf~ defined via ~functor~ --- see Part VII)

*** Level 6: Dependent types (Pi)

#+begin_src prologos
spec replicate <(n : Nat) -> A -> [Vec A n]>
  :implicits {A : Type}
  :doc "Create a vector of n copies of a value"
  :examples
    - [replicate 3N :x] => @[:x :x :x]
  :properties
    - :name "correct-length"
      :forall {n : Nat} {a : A}
      :holds [eq? [length [replicate n a]] n]
#+end_src

*** Level 7: Dependent types (Sigma / existential)

#+begin_src prologos
spec filter [A -> Bool] -> [List A] -> <(result : [List A]) * [SubList result xs]>
  :implicits {A : Type}
  :doc "Filter elements, with proof that result is a sublist"
#+end_src

** Key Ergonomic Decisions

1. *Pi/Sigma types never need to leak to the surface*: ~functor~ declarations
   name complex type abstractions with approachable metadata. The underlying
   Pi type lives in ~:unfolds~, consulted only when needed.

2. *Angle brackets contain the complexity*: ~<...>~ delimits the dependent part
   of a type. Everything outside angle brackets is familiar ML-style syntax.

3. *Metadata explains the theory*: The ~:doc~ key provides human-readable
   explanation. Properties double as documentation and specification.

4. *Examples ground the abstraction*: Every complex type should have concrete
   examples. The ~:examples~ key makes this a first-class concern.

5. *Where-clauses read as English*: "sort takes a list of A where A has ordering"
   is near-English. The trait constraint system hides the dictionary-passing
   mechanism.

6. *Properties express what the function /means/*: Rather than encoding
   everything in the type (which can be opaque), properties express semantic
   invariants in a universally readable format.

7. *~:implicits~ declutters signatures*: Implicit binders move to metadata when
   they would add visual weight to the type signature.

