docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsection{Name Scoping in \texttt{:includes}}
\label{sec:orgef070df}

When \texttt{monad-laws} includes \texttt{applicative-laws} which includes \texttt{functor-laws},
and both \texttt{monad-laws} and \texttt{functor-laws} define a property named \texttt{"identity"}:
names are scoped to their declaring \texttt{property} block.

Flattened property names use \texttt{/} qualification:
\texttt{functor-laws/identity}, \texttt{applicative-laws/identity}, \texttt{monad-laws/left-identity}.

This parallels how trait methods are scoped to their trait.
\subsection{The Symmetry}
\label{sec:org7b72b98}

\begin{verbatim}
trait     : Type → Set of method signatures     (what you must implement)
bundle    : conjunction of traits                (shorthand for multiple traits)
property  : Type → Set of propositions           (what must be true)
  includes: conjunction of properties            (shorthand for multiple properties)

spec      : function → type + metadata
  :where  : trait constraints                    (what the types must support)
  :properties : property constraints             (what the function must satisfy)

instance  : Type → method implementations        (how you implement)
  (auto)  : Type → property evidence             (how you prove / test)
\end{verbatim}

Traits say what operations exist. Properties say what laws they obey. Today only
the first is checked; this design gives us a path to checking the second.
\section{Part V: Expressing Higher-Kinded Pi Types Ergonomically}
\label{sec:orgeeb260e}

\subsection{The Problem}
\label{sec:orgae55810}

Complex higher-kinded and higher-rank types are unreadable:

\begin{verbatim}
;; Current xf-compose signature:
spec xf-compose {A B C : Type} <(S :0 Type) -> [S -> B -> S] -> S -> A -> S> <(S :0 Type) -> [S -> C -> S] -> S -> B -> S> -> <(S :0 Type) -> [S -> C -> S] -> S -> A -> S>
\end{verbatim}

The transducer module already identifies the abstraction in a comment:
\texttt{Type: Xf A B = forall R. (R -> B -> R) -> (R -> A -> R)}. With the right name,
the signature becomes: \texttt{[Xf A B] -> [Xf B C] -> [Xf A C]} --- category-theoretic
composition, instantly readable.
\subsection{Progressive Complexity Levels}
\label{sec:org0cad009}

\subsubsection{Level 0: No types (inference only)}
\label{sec:orgf108ba9}

\begin{verbatim}
defn add [x y] [nat-add x y]
\end{verbatim}
\subsubsection{Level 1: Simple spec (monomorphic)}
\label{sec:org1f36fc0}

\begin{verbatim}
spec add Nat Nat -> Nat
defn add [x y] [nat-add x y]
\end{verbatim}
\subsubsection{Level 2: Polymorphic spec}
\label{sec:orgb11e810}

\begin{verbatim}
spec id A -> A
defn id [x] x
\end{verbatim}

(\texttt{\{A : Type\}} inferred from \texttt{A} appearing free in signature)
\subsubsection{Level 3: Constrained polymorphism}
\label{sec:orgdaba1b2}

\begin{verbatim}
spec sort [List A] -> [List A]
  :where (Ord A)
defn sort [xs] ...
\end{verbatim}
\subsubsection{Level 4: Higher-kinded polymorphism}
\label{sec:org38b8e50}

\begin{verbatim}
spec fmap [A -> B] -> [F A] -> [F B]
  :where (Functor F)
  :doc "Apply a function inside a functor"
  :properties (functor-laws F)
defn fmap [f xs] ...
\end{verbatim}

(\texttt{\{A B : Type\}} inferred; \texttt{\{F : Type -> Type\}} inferred from \texttt{(Functor F)}
where clause --- the trait declares the kind)
\subsubsection{Level 5: Named type abstractions (functor)}
\label{sec:org9f24479}

\begin{verbatim}
spec xf-compose [Xf A B] -> [Xf B C] -> [Xf A C]
  :implicits {A B C : Type}
  :properties (transducer-fusion-laws A B C)
\end{verbatim}

(\texttt{Xf} defined via \texttt{functor} --- see Part VII)
\subsubsection{Level 6: Dependent types (Pi)}
\label{sec:org037b864}

\begin{verbatim}
spec replicate <(n : Nat) -> A -> [Vec A n]>
  :implicits {A : Type}
  :doc "Create a vector of n copies of a value"
  :examples
    - [replicate 3N :x] => @[:x :x :x]
  :properties
    - :name "correct-length"
      :forall {n : Nat} {a : A}
      :holds [eq? [length [replicate n a]] n]
\end{verbatim}
\subsubsection{Level 7: Dependent types (Sigma / existential)}
\label{sec:org7e6c38f}

\begin{verbatim}
spec filter [A -> Bool] -> [List A] -> <(result : [List A]) * [SubList result xs]>
  :implicits {A : Type}
  :doc "Filter elements, with proof that result is a sublist"
\end{verbatim}
\subsection{Key Ergonomic Decisions}
\label{sec:orgcdf26c6}

\begin{enumerate}
\item \textbf{Pi/Sigma types never need to leak to the surface}: \texttt{functor} declarations
name complex type abstractions with approachable metadata. The underlying
Pi type lives in \texttt{:unfolds}, consulted only when needed.

\item \textbf{Angle brackets contain the complexity}: \texttt{<...>} delimits the dependent part
of a type. Everything outside angle brackets is familiar ML-style syntax.

\item \textbf{Metadata explains the theory}: The \texttt{:doc} key provides human-readable
explanation. Properties double as documentation and specification.

\item \textbf{Examples ground the abstraction}: Every complex type should have concrete
examples. The \texttt{:examples} key makes this a first-class concern.

\item \textbf{Where-clauses read as English}: "sort takes a list of A where A has ordering"
is near-English. The trait constraint system hides the dictionary-passing
mechanism.

\item \textbf{Properties express what the function \emph{means}}: Rather than encoding
everything in the type (which can be opaque), properties express semantic
invariants in a universally readable format.

\item \textbf{\texttt{:implicits} declutters signatures}: Implicit binders move to metadata when
they would add visual weight to the type signature.
\end{enumerate}
