docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.md


<a id="orga2e4468"></a>

## Name Scoping in `:includes`

When `monad-laws` includes `applicative-laws` which includes `functor-laws`, and both `monad-laws` and `functor-laws` define a property named `"identity"`: names are scoped to their declaring `property` block.

Flattened property names use `/` qualification: `functor-laws/identity`, `applicative-laws/identity`, `monad-laws/left-identity`.

This parallels how trait methods are scoped to their trait.


<a id="orgd1d5169"></a>

## The Symmetry

```
trait     : Type → Set of method signatures     (what you must implement)
bundle    : conjunction of traits                (shorthand for multiple traits)
property  : Type → Set of propositions           (what must be true)
  includes: conjunction of properties            (shorthand for multiple properties)

spec      : function → type + metadata
  :where  : trait constraints                    (what the types must support)
  :properties : property constraints             (what the function must satisfy)

instance  : Type → method implementations        (how you implement)
  (auto)  : Type → property evidence             (how you prove / test)
```

Traits say what operations exist. Properties say what laws they obey. Today only the first is checked; this design gives us a path to checking the second.


<a id="org4f78ecc"></a>

# Part V: Expressing Higher-Kinded Pi Types Ergonomically


<a id="org894aaf7"></a>

## The Problem

Complex higher-kinded and higher-rank types are unreadable:

```prologos
;; Current xf-compose signature:
spec xf-compose {A B C : Type} <(S :0 Type) -> [S -> B -> S] -> S -> A -> S> <(S :0 Type) -> [S -> C -> S] -> S -> B -> S> -> <(S :0 Type) -> [S -> C -> S] -> S -> A -> S>
```

The transducer module already identifies the abstraction in a comment: `Type: Xf A B = forall R. (R -> B -> R) -> (R -> A -> R)`. With the right name, the signature becomes: `[Xf A B] -> [Xf B C] -> [Xf A C]` &#x2014; category-theoretic composition, instantly readable.


<a id="org7fc9c4e"></a>

## Progressive Complexity Levels


<a id="org42922db"></a>

### Level 0: No types (inference only)

```prologos
defn add [x y] [nat-add x y]
```


<a id="org9c5990c"></a>

### Level 1: Simple spec (monomorphic)

```prologos
spec add Nat Nat -> Nat
defn add [x y] [nat-add x y]
```


<a id="org28857eb"></a>

### Level 2: Polymorphic spec

```prologos
spec id A -> A
defn id [x] x
```

(`{A : Type}` inferred from `A` appearing free in signature)


<a id="org127641d"></a>

### Level 3: Constrained polymorphism

```prologos
spec sort [List A] -> [List A]
  :where (Ord A)
defn sort [xs] ...
```


<a id="org671d016"></a>

### Level 4: Higher-kinded polymorphism

```prologos
spec fmap [A -> B] -> [F A] -> [F B]
  :where (Functor F)
  :doc "Apply a function inside a functor"
  :properties (functor-laws F)
defn fmap [f xs] ...
```

(`{A B : Type}` inferred; `{F : Type -> Type}` inferred from `(Functor F)` where clause &#x2014; the trait declares the kind)


<a id="orgce20836"></a>

### Level 5: Named type abstractions (functor)

```prologos
spec xf-compose [Xf A B] -> [Xf B C] -> [Xf A C]
  :implicits {A B C : Type}
  :properties (transducer-fusion-laws A B C)
```

(`Xf` defined via `functor` &#x2014; see Part VII)


<a id="orgafc5764"></a>

### Level 6: Dependent types (Pi)

```prologos
spec replicate <(n : Nat) -> A -> [Vec A n]>
  :implicits {A : Type}
  :doc "Create a vector of n copies of a value"
  :examples
    - [replicate 3N :x] => @[:x :x :x]
  :properties
    - :name "correct-length"
      :forall {n : Nat} {a : A}
      :holds [eq? [length [replicate n a]] n]
```


<a id="org5b8e6f0"></a>

### Level 7: Dependent types (Sigma / existential)

```prologos
spec filter [A -> Bool] -> [List A] -> <(result : [List A]) * [SubList result xs]>
  :implicits {A : Type}
  :doc "Filter elements, with proof that result is a sublist"
```


<a id="org4674013"></a>

## Key Ergonomic Decisions

1.  **Pi/Sigma types never need to leak to the surface**: `functor` declarations name complex type abstractions with approachable metadata. The underlying Pi type lives in `:unfolds`, consulted only when needed.

2.  **Angle brackets contain the complexity**: `<...>` delimits the dependent part of a type. Everything outside angle brackets is familiar ML-style syntax.

3.  **Metadata explains the theory**: The `:doc` key provides human-readable explanation. Properties double as documentation and specification.

4.  **Examples ground the abstraction**: Every complex type should have concrete examples. The `:examples` key makes this a first-class concern.

5.  **Where-clauses read as English**: "sort takes a list of A where A has ordering" is near-English. The trait constraint system hides the dictionary-passing mechanism.

6.  **Properties express what the function *means***: Rather than encoding everything in the type (which can be opaque), properties express semantic invariants in a universally readable format.

7.  **`:implicits` declutters signatures**: Implicit binders move to metadata when they would add visual weight to the type signature.
