docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\section{Part VI: Improved Implicit Inference}
\label{sec:org1651ace}

Today, \texttt{\{A : Type\}} is required even when \texttt{A} appears in the type signature
(e.g., \texttt{[List A] -> Nat}). The type checker can already infer this in many
cases. Two improvements are proposed:
\subsection{Direction 1: Auto-introduce unbound type variables}
\label{sec:orgc330027}

If a capitalized identifier \texttt{A} appears free in the type signature and is not
bound by any explicit binder, auto-introduce \texttt{\{A : Type\}}. This already works
for simple cases; the proposal is to make it the documented, reliable behavior.

\begin{verbatim}
;; These would be equivalent:
spec length {A : Type} [List A] -> Nat
spec length [List A] -> Nat
\end{verbatim}
\subsection{Direction 2: Kind inference from \texttt{:where} clauses}
\label{sec:org01efac9}

If \texttt{C} appears in \texttt{:where (Seqable C)} and \texttt{Seqable} is declared over
\texttt{\{C : Type -> Type\}}, infer \texttt{C}'s kind from the where clause. This eliminates
the most annoying case --- having to write \texttt{\{C : Type -> Type\}} just because
you use an HKT trait.

\begin{verbatim}
;; These would be equivalent:
spec gmap {A B : Type} {C : Type -> Type} [A -> B] -> [C A] -> [C B]
  :where (Seqable C) (Buildable C)

spec gmap [A -> B] -> [C A] -> [C B]
  :where (Seqable C) (Buildable C)
\end{verbatim}

Note: \texttt{propagate-kinds-from-constraints} already does this internally. The
proposal is to make it work when explicit \texttt{\{...\}} binders are omitted entirely.
\subsection{Explicit Always Available}
\label{sec:orge509b73}

Explicit binders remain for: pedagogic clarity, disambiguation when inference
produces unexpected results, and the rare cases where no constraining position
exists (e.g., \texttt{spec empty \{A : Type\} [List A]}).
\section{Part VII: The \texttt{functor} Keyword}
\label{sec:org643c950}

\subsection{Motivation}
\label{sec:org8ecdc2a}

The \texttt{functor} keyword provides named type abstractions with category-theoretic
metadata. It solves the fundamental readability problem of higher-kinded and
higher-rank types by giving them \emph{meaning through structure}, not just through
their expansion.

The design philosophy: you understand \texttt{Xf A B} by knowing what it \emph{does} (":doc
A transducer"), how it \emph{combines} (":compose xf-compose"), and what \emph{rules} it
follows (":laws transducer-fusion-laws"). The Pi type it unfolds to is available
but is consulted last, not first.
\subsection{Syntax}
\label{sec:org58e0864}

\begin{verbatim}
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :compose xf-compose
  :identity id-xf
  :laws (transducer-fusion-laws A B)
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
\end{verbatim}
\subsection{Progressive Disclosure}
\label{sec:org96ac7a6}

Like \texttt{spec}, the metadata keys are progressive. Simple synonyms are minimal:

\begin{verbatim}
functor FilePath
  :unfolds String
\end{verbatim}

Parameterized synonyms add type parameters:

\begin{verbatim}
functor Result {A}
  :unfolds [Either String A]
  :doc "A computation that may fail with a string error"
\end{verbatim}

Algebraically structured types add operations:

\begin{verbatim}
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :compose xf-compose
  :identity id-xf
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
\end{verbatim}

Full category-theoretic treatment adds laws:

\begin{verbatim}
functor Lens {S T A B : Type}
  :doc "A bidirectional accessor: view and update a part of a structure"
  :compose lens-compose
  :identity lens-id
  :laws (lens-laws S T A B)
  :see-also [Prism Traversal Iso]
  :unfolds <{F : Type -> Type} -> (Functor F) -> [A -> [F B]] -> S -> [F T]>
\end{verbatim}
\subsection{Category-Theoretic Metadata Keys}
\label{sec:orgf638b8b}

The keys map CT concepts to approachable language:

\begin{center}
\begin{tabular}{lll}
CT concept & Key & Meaning in plain English\\
\hline
Object mapping & \texttt{:unfolds} & "What this actually expands to under the hood"\\
Morphism composition & \texttt{:compose} & "How to chain two of these together"\\
Identity morphism & \texttt{:identity} & "The do-nothing version"\\
Laws & \texttt{:laws} & "What rules these always follow"\\
Documentation & \texttt{:doc} & "What this means in human terms"\\
Natural transformation & \texttt{:transforms} & "How to convert between different functors" (future)\\
Adjunction & \texttt{:adjoint} & "What functor is this paired with" (far future)\\
\end{tabular}
\end{center}

Only \texttt{:unfolds} is required (for Phase 1). The rest are progressive. A user
who never thinks about category theory writes:

\begin{verbatim}
functor Xf {A B : Type}
  :doc "A transducer"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
\end{verbatim}

A user who cares about algebraic structure adds \texttt{:compose} and \texttt{:identity}. A
user who wants verification adds \texttt{:laws}. The CT is always there but only
surfaces when you reach for it.
