docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.md


<a id="org1cc47c5"></a>

# Part VI: Improved Implicit Inference

Today, `{A : Type}` is required even when `A` appears in the type signature (e.g., `[List A] -> Nat`). The type checker can already infer this in many cases. Two improvements are proposed:


<a id="org8dde6a0"></a>

## Direction 1: Auto-introduce unbound type variables

If a capitalized identifier `A` appears free in the type signature and is not bound by any explicit binder, auto-introduce `{A : Type}`. This already works for simple cases; the proposal is to make it the documented, reliable behavior.

```prologos
;; These would be equivalent:
spec length {A : Type} [List A] -> Nat
spec length [List A] -> Nat
```


<a id="org08e32d4"></a>

## Direction 2: Kind inference from `:where` clauses

If `C` appears in `:where (Seqable C)` and `Seqable` is declared over `{C : Type -> Type}`, infer `C`'s kind from the where clause. This eliminates the most annoying case &#x2014; having to write `{C : Type -> Type}` just because you use an HKT trait.

```prologos
;; These would be equivalent:
spec gmap {A B : Type} {C : Type -> Type} [A -> B] -> [C A] -> [C B]
  :where (Seqable C) (Buildable C)

spec gmap [A -> B] -> [C A] -> [C B]
  :where (Seqable C) (Buildable C)
```

Note: `propagate-kinds-from-constraints` already does this internally. The proposal is to make it work when explicit `{...}` binders are omitted entirely.


<a id="orgc85cf10"></a>

## Explicit Always Available

Explicit binders remain for: pedagogic clarity, disambiguation when inference produces unexpected results, and the rare cases where no constraining position exists (e.g., `spec empty {A : Type} [List A]`).


<a id="org8f52581"></a>

# Part VII: The `functor` Keyword


<a id="org0113442"></a>

## Motivation

The `functor` keyword provides named type abstractions with category-theoretic metadata. It solves the fundamental readability problem of higher-kinded and higher-rank types by giving them *meaning through structure*, not just through their expansion.

The design philosophy: you understand `Xf A B` by knowing what it *does* (":doc A transducer"), how it *combines* (":compose xf-compose"), and what *rules* it follows (":laws transducer-fusion-laws"). The Pi type it unfolds to is available but is consulted last, not first.


<a id="org10cd2aa"></a>

## Syntax

```prologos
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :compose xf-compose
  :identity id-xf
  :laws (transducer-fusion-laws A B)
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
```


<a id="orgf72b522"></a>

## Progressive Disclosure

Like `spec`, the metadata keys are progressive. Simple synonyms are minimal:

```prologos
functor FilePath
  :unfolds String
```

Parameterized synonyms add type parameters:

```prologos
functor Result {A}
  :unfolds [Either String A]
  :doc "A computation that may fail with a string error"
```

Algebraically structured types add operations:

```prologos
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :compose xf-compose
  :identity id-xf
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
```

Full category-theoretic treatment adds laws:

```prologos
functor Lens {S T A B : Type}
  :doc "A bidirectional accessor: view and update a part of a structure"
  :compose lens-compose
  :identity lens-id
  :laws (lens-laws S T A B)
  :see-also [Prism Traversal Iso]
  :unfolds <{F : Type -> Type} -> (Functor F) -> [A -> [F B]] -> S -> [F T]>
```


<a id="org98aaa59"></a>

## Category-Theoretic Metadata Keys

The keys map CT concepts to approachable language:

| CT concept             | Key           | Meaning in plain English                             |
|---------------------- |------------- |---------------------------------------------------- |
| Object mapping         | `:unfolds`    | "What this actually expands to under the hood"       |
| Morphism composition   | `:compose`    | "How to chain two of these together"                 |
| Identity morphism      | `:identity`   | "The do-nothing version"                             |
| Laws                   | `:laws`       | "What rules these always follow"                     |
| Documentation          | `:doc`        | "What this means in human terms"                     |
| Natural transformation | `:transforms` | "How to convert between different functors" (future) |
| Adjunction             | `:adjoint`    | "What functor is this paired with" (far future)      |

Only `:unfolds` is required (for Phase 1). The rest are progressive. A user who never thinks about category theory writes:

```prologos
functor Xf {A B : Type}
  :doc "A transducer"
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
```

A user who cares about algebraic structure adds `:compose` and `:identity`. A user who wants verification adds `:laws`. The CT is always there but only surfaces when you reach for it.
