docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.org
** Why ~functor~ and Not ~abbrev~ or ~type~

~abbrev~ doesn't capture the ambition. An abbreviation is just a shorter name
for the same thing. What we're proposing is a /named abstraction with declared
structure/ --- the operations, laws, documentation are first-class. ~abbrev~
makes you think of ~typedef~ --- mechanical shortening. ~functor~ makes you
think of structure-preserving mappings --- which is what these actually are.

~type~ clashes with ~deftype~ (which creates algebraic data types with
constructors). A ~functor~ doesn't create constructors; it names a type with
structure.

The ~functor~ (keyword) vs ~Functor~ (trait) naming is consistent with Prologos's
existing pattern: all keywords are lowercase (~spec~, ~defn~, ~trait~, ~bundle~);
all type/trait names are capitalized. The relationship: a ~functor~ declaration
might /itself/ be a ~Functor~ instance (in the trait sense). The keyword names
the concept; the trait constrains it.

** Transparency Model

~functor~ declarations are transparent by default (like Lean's ~abbrev~). The
type checker unfolds ~Xf A B~ to its ~:unfolds~ form during elaboration. Trait
instances carry through: if ~Eq (Xf Nat Bool)~ is needed and ~Eq~ has an
instance for the expanded type, it resolves.

Future consideration: opaque functors (no ~:unfolds~, only described by
operations) for abstract type boundaries. Deferred to post-Phase 1.

** Error Messages

Error messages show the ~functor~ name by default:

#+begin_example
Error: Expected [Xf Nat Bool], got [Xf Nat Nat]
#+end_example

Not the expanded form. An ~--expand-types~ flag or editor hover reveals the
full type when needed.

** How ~functor~ Composes with ~spec~, ~property~, and ~trait~

#+begin_src prologos
;; The type abstraction
functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :compose xf-compose
  :identity id-xf
  :laws (transducer-fusion-laws A B)
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>

;; Reusable properties (using the functor name!)
property transducer-fusion-laws {A B C : Type}
  - :name "compose-associativity"
    :forall {f : [Xf A B]} {g : [Xf B C]} {h : [Xf C D]}
    :holds [eq? [xf-compose [xf-compose f g] h] [xf-compose f [xf-compose g h]]]
  - :name "left-identity"
    :forall {f : [Xf A B]}
    :holds [eq? [xf-compose id-xf f] f]
  - :name "right-identity"
    :forall {f : [Xf A B]}
    :holds [eq? [xf-compose f id-xf] f]

;; Function specs using the functor name
spec xf-compose [Xf A B] -> [Xf B C] -> [Xf A C]
  :implicits {A B C : Type}
  :doc "Compose two transducers (apply first argument first)"
  :properties (transducer-fusion-laws A B C)

spec map-xf [A -> B] -> [Xf A B]
  :implicits {A B : Type}
  :doc "Transform each element through f before passing to reducer"

spec filter-xf [A -> Bool] -> [Xf A A]
  :implicits {A : Type}
  :doc "Only pass elements satisfying pred to the reducer"

spec transduce [Xf A B] -> [R -> B -> R] -> R -> [List A] -> R
  :implicits {A B R : Type}
  :doc "Apply a transducer to a list with a reducer and initial accumulator"

spec into-list [Xf A B] -> [List A] -> [List B]
  :implicits {A B : Type}
  :doc "Transduce into a correctly-ordered list"
  :examples
    - [into-list [map-xf suc] '[1N 2N 3N]] => '[2N 3N 4N]
#+end_src

The ~functor~ names the type. The ~property~ states its laws. The ~spec~ uses
both. Everything is readable. The Pi types are present exactly once, in
~:unfolds~, consulted only when necessary.

* Part VIII: Implementation Considerations

** spec-entry Struct Extension

The recommended approach: add a single ~metadata~ field that stores the entire
keyword map as a hash table. Individual accessors extract from the metadata hash.
This avoids struct migration pain:

#+begin_src racket
(struct spec-entry
  (type-datums docstring multi? srcloc where-constraints
   implicit-binders rest-type
   metadata)  ;; <-- one new field: hasheq of keyword -> datum
  #:transparent)

;; Accessor helpers:
(define (spec-entry-examples e)
  (hash-ref (or (spec-entry-metadata e) (hasheq)) ':examples '()))
(define (spec-entry-properties e)
  (hash-ref (or (spec-entry-metadata e) (hasheq)) ':properties '()))
(define (spec-entry-implicits-meta e)
  (hash-ref (or (spec-entry-metadata e) (hasheq)) ':implicits #f))
#+end_src

** rewrite-implicit-map Extension

Currently scoped to ~def~ and ~defn~ heads (macros.rkt line 2452). Extending to
~spec~ is a one-line change in the ~memq~ check. However, the spec head requires
special handling: the type signature tokens must be separated from the trailing
keyword map. This can be done by scanning for the first keyword-headed child
whose indentation matches the spec's indentation level.

** Typed Hole AST Node

#+begin_src racket
(struct expr-typed-hole (name) #:transparent)  ;; name is #f or symbol
#+end_src

Type checker (typing-core.rkt): when encountering ~expr-typed-hole~, compute
the expected type from the context and emit a diagnostic report rather than
returning ~(expr-error)~.

