docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.md


<a id="org45bd11c"></a>

## property-entry Store

```racket
(struct property-entry
  (name           ;; symbol
   params         ;; alist of ((name . kind) ...)
   where-clauses  ;; (listof constraint)
   includes       ;; (listof (property-ref ...))
   clauses        ;; (listof property-clause)
   metadata)      ;; hasheq for extensibility
  #:transparent)

(struct property-clause
  (name           ;; string (human-readable label)
   forall-binders ;; alist of ((name . type) ...)
   holds-expr)    ;; datum (boolean expression)
  #:transparent)

(define current-property-store (make-parameter (hasheq)))
```

`:includes` references are resolved at registration time by looking up the included property in the store and appending its (flattened) clauses. Clause names are prefixed with the declaring property's name and `/`.


<a id="org185a014"></a>

## functor-entry Store

```racket
(struct functor-entry
  (name         ;; symbol (capitalized)
   params       ;; alist of ((name . kind) ...)
   unfolds      ;; type datum (the expansion)
   metadata)    ;; hasheq (:compose, :identity, :laws, :doc, etc.)
  #:transparent)

(define current-functor-store (make-parameter (hasheq)))
```

During elaboration, when the elaborator encounters a capitalized identifier followed by arguments that matches a registered functor, it expands to the `unfolds` form with parameters substituted.


<a id="org754aea0"></a>

## `:implicits` Merging in process-spec

```racket
;; In process-spec, after extracting metadata:
(define meta-implicits
  (if metadata
      (extract-binders-from-implicits-key metadata)
      '()))
(define merged-implicits
  (deduplicate-binders (append inline-implicits meta-implicits)))
;; Warn on duplicates between inline and :implicits
```


<a id="orgb7fe51c"></a>

## Grammar Extensions

Additions to `grammar.ebnf`:

```ebnf
(* Typed holes for interactive development *)
typed-hole      = '??' , [ identifier ] ;

(* Extended spec with optional metadata *)
spec-form       = 'spec' , identifier , spec-body , [ spec-metadata ] ;
spec-metadata   = spec-meta-entry , { spec-meta-entry } ;
spec-meta-entry = keyword-literal , spec-meta-value ;
spec-meta-value = expr
                | dash-list
                | spec-meta-map
                ;

(* Property declarations *)
property-form   = 'property' , identifier , [ implicit-binders ]
                , [ property-metadata ] , { property-clause } ;
property-metadata = property-meta-entry , { property-meta-entry } ;
property-meta-entry = ':where' , '(' , constraint , { constraint } , ')'
                    | ':includes' , '(' , property-ref , { property-ref } , ')'
                    ;
property-clause = '-' , ':name' , string-literal
                , ':forall' , '{' , binder , { binder } , '}'
                , ':holds' , expr ;

(* Functor declarations *)
functor-form    = 'functor' , identifier , [ implicit-binders ]
                , functor-metadata ;
functor-metadata = functor-meta-entry , { functor-meta-entry } ;
functor-meta-entry = ':unfolds' , type-expr
                   | ':compose' , identifier
                   | ':identity' , identifier
                   | ':laws' , '(' , property-ref , { property-ref } , ')'
                   | ':doc' , string-literal
                   | ':see-also' , '[' , identifier , { identifier } , ']'
                   ;
```


<a id="org607b9f0"></a>

# Part IX: Worked Examples


<a id="org532da18"></a>

## Example 1: Simple spec with documentation, examples, and reusable properties

```prologos
property cons-head-law {A : Type}
  - :name "head-of-cons"
    :forall {x : A} {xs : [List A]}
    :holds [eq? [head [cons x xs]] [just x]]

spec head [List A] -> A?
  :implicits {A : Type}
  :doc "Returns the first element, or nothing if empty"
  :examples
    - [head '[1N 2N 3N]] => [just 1N]
    - [head '[]] => nothing
  :properties (cons-head-law A)

defn head
  | [nil]        -> nothing
  | [[cons h _]] -> [just h]
```


<a id="orgbc7f7a6"></a>

## Example 2: Contract-style spec

```prologos
spec divide Int Int -> Int
  :pre (fn [_ y] [not [eq? y 0]])
  :post (fn [x y r] [eq? [+ [* r y] [int-mod x y]] x])
  :doc "Integer division; undefined for zero divisor"

defn divide [x y] [int-div x y]
```


<a id="orgbd8cf62"></a>

## Example 3: Higher-kinded functor laws (using property + :laws)

```prologos
property functor-laws {F : Type -> Type}
  :where (Functor F)
  - :name "identity-law"
    :forall {xs : [F A]}
    :holds [eq? [fmap id xs] xs]
  - :name "composition-law"
    :forall {f : [A -> B]} {g : [B -> C]} {xs : [F A]}
    :holds [eq? [fmap [>> f g] xs] [fmap g [fmap f xs]]]

trait Functor {F : Type -> Type}
  :laws (functor-laws F)
  spec fmap {A B : Type} [A -> B] -> [F A] -> [F B]

spec fmap [A -> B] -> [F A] -> [F B]
  :where (Functor F)
  :properties (functor-laws F)
```
