docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.md


<a id="org7d4aa7c"></a>

## Example 4: Transducer module (functor + property + spec)

```prologos
ns prologos::data::transducer

functor Xf {A B : Type}
  :doc "A transducer: transforms A-reductions into B-reductions"
  :compose xf-compose
  :identity id-xf
  :laws (transducer-fusion-laws A B)
  :unfolds <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>

property transducer-fusion-laws {A B C : Type}
  - :name "compose-associativity"
    :forall {f : [Xf A B]} {g : [Xf B C]} {h : [Xf C D]}
    :holds [eq? [xf-compose [xf-compose f g] h] [xf-compose f [xf-compose g h]]]
  - :name "left-identity"
    :forall {f : [Xf A B]}
    :holds [eq? [xf-compose id-xf f] f]
  - :name "right-identity"
    :forall {f : [Xf A B]}
    :holds [eq? [xf-compose f id-xf] f]

spec map-xf [A -> B] -> [Xf A B]
  :implicits {A B : Type}
  :doc "Transform each element through f before passing to reducer"

spec filter-xf [A -> Bool] -> [Xf A A]
  :implicits {A : Type}
  :doc "Only pass elements satisfying pred to the reducer"

spec xf-compose [Xf A B] -> [Xf B C] -> [Xf A C]
  :implicits {A B C : Type}
  :doc "Compose two transducers (apply first argument first)"
  :properties (transducer-fusion-laws A B C)

spec transduce [Xf A B] -> [R -> B -> R] -> R -> [List A] -> R
  :implicits {A B R : Type}
  :doc "Apply a transducer to a list with a reducer and initial accumulator"

spec into-list [Xf A B] -> [List A] -> [List B]
  :implicits {A B : Type}
  :doc "Transduce into a correctly-ordered list"
  :examples
    - [into-list [map-xf suc] '[1N 2N 3N]] => '[2N 3N 4N]
```


<a id="org114b901"></a>

## Example 5: Interactive development with ??

```prologos
spec reverse [List A] -> [List A]
  :implicits {A : Type}
  :properties
    - :name "involution"
      :forall {xs : [List Nat]}
      :holds [eq? [reverse [reverse xs]] xs]
    - :name "length-preserving"
      :forall {xs : [List Nat]}
      :holds [eq? [length [reverse xs]] [length xs]]

defn reverse
  | [nil]        -> nil
  | [[cons h t]] -> ??
  ;; Type system reports:
  ;;   Hole ?? : [List A]
  ;;   Context: h : A, t : [List A], reverse : [List A] -> [List A]
  ;;   Suggestions: [append [reverse t] [cons h nil]]
```


<a id="orgefd0629"></a>

## Example 6: Algebraic property hierarchy

```prologos
property semigroup-laws {A : Type}
  :where (Add A)
  - :name "associativity"
    :forall {x y z : A}
    :holds [eq? [add [add x y] z] [add x [add y z]]]

property monoid-laws {A : Type}
  :where (Add A) (AdditiveIdentity A)
  :includes (semigroup-laws A)
  - :name "left-identity"
    :forall {x : A}
    :holds [eq? [add additive-identity x] x]
  - :name "right-identity"
    :forall {x : A}
    :holds [eq? [add x additive-identity] x]

;; Usage:
spec fold [A -> A -> A] -> A -> [List A] -> A
  :implicits {A : Type}
  :where (Add A) (AdditiveIdentity A)
  :properties (monoid-laws A)
```


<a id="org899cb3c"></a>

## Example 7: Optics (functor for Lens)

```prologos
functor Lens {S T A B : Type}
  :doc "A bidirectional accessor: view and update a part of a structure"
  :compose lens-compose
  :identity lens-id
  :laws (lens-laws S T A B)
  :see-also [Prism Traversal Iso]
  :unfolds <{F : Type -> Type} -> (Functor F) -> [A -> [F B]] -> S -> [F T]>

spec lens-view [Lens S S A A] -> S -> A
  :doc "Extract the focus from a structure"

spec lens-set [Lens S S A A] -> A -> S -> S
  :doc "Replace the focus in a structure"
  :properties
    - :name "set-get"
      :forall {l : [Lens S S A A]} {s : S} {a : A}
      :holds [eq? [lens-view l [lens-set l a s]] a]
```


<a id="orgf802ba9"></a>

## Example 8: Refinement type (future)

```prologos
spec abs Int -> Int
  :refines (fn [r] [>= r 0])
  :doc "Absolute value --- result is always non-negative"

;; Internally, :refines compiles to return type:
;; <(r : Int) * [GTE r 0]>
;; The function returns a pair: the result AND a proof of non-negativity
```


<a id="orge4c0315"></a>

## Example 9: Dependent-type-heavy spec

```prologos
spec zip-with-vec <(n : Nat) -> [A -> B -> C] -> [Vec A n] -> [Vec B n] -> [Vec C n]>
  :implicits {A B C : Type}
  :doc "Zip two vectors of the same length with a combining function"
  :examples
    - [zip-with-vec 3N + @[1 2 3] @[10 20 30]] => @[11 22 33]
  :properties
    - :name "preserves-length"
      :forall {n : Nat} {f : [Int -> Int -> Int]}
              {xs : [Vec Int n]} {ys : [Vec Int n]}
      :holds [eq? [vec-length [zip-with-vec n f xs ys]] n]
```


<a id="org3e68e2c"></a>

# Part X: Phased Roadmap


<a id="org87d3767"></a>

## Phase 1: Syntax and Storage (Near-term)

**In scope now**:

-   Extend `rewrite-implicit-map` to trigger on `spec` heads
-   Extend `process-spec` to extract keyword entries into metadata hash
-   Add `metadata` field to `spec-entry`
-   `:implicits` key: extract from metadata, merge with inline binders
-   `:doc` replaces positional docstring; `:where` augments positional `where`
-   Store `:examples`, `:see-also` in metadata
-   `??` reader token and `expr-typed-hole` AST node (report-only)
-   `property` keyword: parser, store, `:includes` flattening, name-scoped clauses
-   `:laws` key on `trait` declarations
-   `functor` keyword: parser, store, transparent expansion during elaboration
-   Grammar updates (grammar.ebnf, grammar.org)
