docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsection{Phase 1b: Improved Implicit Inference}
\label{sec:org84cbb25}

\begin{itemize}
\item Auto-introduce unbound type variables as \texttt{\{X : Type\}}
\item Kind inference from \texttt{:where} clauses (extend \texttt{propagate-kinds-from-constraints}
to work when no explicit binders are present)
\item Goal: \texttt{\{A : Type\}} almost never needed for kind-\texttt{Type} variables;
\texttt{\{C : Type -> Type\}} unnecessary when \texttt{:where} pins the kind
\end{itemize}
\subsection{Phase 2: Example and Property Checking (Medium-term)}
\label{sec:org42f4b34}

\begin{itemize}
\item Parse \texttt{:examples} entries, type-check them, run them as tests
\item \texttt{Gen} trait for type-directed random value generation
\item Parse \texttt{:properties}, generate random inputs from types, check \texttt{:holds}
\item Property checking for \texttt{:laws} on trait instances
\item Contract wrapping: \texttt{:pre\textasciitilde{}/}:post\textasciitilde{} generate runtime checks at function
boundaries (Racket-contract style blame tracking)
\end{itemize}
\subsection{Phase 3: Refinement and Verification (Long-term)}
\label{sec:orgb81e8ed}

\begin{itemize}
\item \texttt{:refines} compiles to Sigma types (return type is \texttt{<(r : T) * P(r)>})
\item \texttt{:properties} become compile-time proof obligations
\item Proof search integration: \texttt{:proof :auto} triggers the logic engine
\item \texttt{:measure} for termination checking
\item Opaque functors (no \texttt{:unfolds}) for abstract type boundaries
\end{itemize}
\subsection{Phase 4: Interactive Theorem Proving (Far future)}
\label{sec:org90b3558}

\begin{itemize}
\item Editor protocol for \texttt{??} hole interaction
\item Case splitting via type information (Agda \texttt{C-c C-c})
\item Proof search (Agda \texttt{C-c C-a}) via propagator-based logic engine
\item Refinement reflection (Liquid Haskell style)
\item \texttt{:transforms} and \texttt{:adjoint} keys on \texttt{functor} for natural transformations
\end{itemize}
\section{Part XI: Resolved Design Questions}
\label{sec:org34386d9}

\begin{enumerate}
\item \textbf{Should \texttt{:where} in the map replace or augment positional \texttt{where}?}
\textbf{Decision}: augment (union of both constraint sets). Positional form
remains for backward compatibility; map form is preferred going forward.

\item \textbf{Should examples use \texttt{=>} or \texttt{->} as the separator?}
\textbf{Decision}: \texttt{=>} to avoid confusion with the arrow in type signatures.

\item \textbf{How should multi-arity specs handle metadata?}
\textbf{Decision}: metadata is function-level (shared across all arities). Each
\texttt{|} branch defines its own type; the metadata applies to the function as a
whole. Properties' \texttt{:forall} types determine which branch is exercised.
Examples' argument types determine dispatch.

\item \textbf{Should \texttt{:properties} quantified variables shadow spec's implicit binders?}
\textbf{Decision}: yes, with a warning. The property is a self-contained
expression; it should be readable without consulting the outer spec.

\item \textbf{What happens to unrecognized keys?}
\textbf{Decision}: store silently (forward-compatibility). Tool-specific keys
(e.g., \texttt{:editor-hint}, \texttt{:benchmark}) can be added without language changes.

\item \textbf{Is \texttt{:unfolds} always required on \texttt{functor}?}
\textbf{Decision}: yes, for Phase 1. Opaque functors (no \texttt{:unfolds}) deferred to
Phase 3.

\item \textbf{Should \texttt{functor} handle non-CT uses (plain type synonyms)?}
\textbf{Decision}: yes --- \texttt{functor} is the single keyword for "I'm naming a type
concept." Progressive metadata: no \texttt{:compose} means no algebraic structure.
\end{enumerate}
\section{References}
\label{sec:org9941de5}

\subsection{Clojure Spec}
\label{sec:orgd4d199e}
\begin{itemize}
\item \href{https://clojure.org/guides/spec}{Clojure Spec Guide}
\item \href{https://clojuredocs.org/clojure.spec.alpha/fdef}{s/fdef Reference}
\item \href{https://clojure.org/about/spec}{Spec Rationale and Overview}
\end{itemize}
\subsection{Malli}
\label{sec:org0d6918d}
\begin{itemize}
\item \href{https://github.com/metosin/malli}{Malli GitHub}
\item \href{https://github.com/metosin/malli/blob/master/docs/function-schemas.md}{Malli Function Schemas}
\end{itemize}
\subsection{PropEr}
\label{sec:org219b434}
\begin{itemize}
\item \href{https://github.com/proper-testing/proper}{PropEr GitHub}
\item \href{https://proper-testing.github.io/tutorials/PropEr\_introduction\_to\_Property-Based\_Testing.html}{PropEr Tutorial}
\end{itemize}
\subsection{Agda}
\label{sec:orge075587}
\begin{itemize}
\item \href{https://agda.readthedocs.io/en/latest/tools/auto.html}{Agda Auto Proof Search}
\item \href{https://agda.readthedocs.io/en/latest/getting-started/a-taste-of-agda.html}{A Taste of Agda}
\end{itemize}
\subsection{Idris 2}
\label{sec:org6842a4c}
\begin{itemize}
\item \href{https://idris2.readthedocs.io/en/latest/tutorial/interactive.html}{Idris 2 Interactive Editing}
\end{itemize}
\subsection{Lean 4}
\label{sec:org56182c0}
\begin{itemize}
\item \href{https://lean-lang.org/theorem\_proving\_in\_lean4/type\_classes.html}{Lean 4 Type Classes}
\item \href{https://lean-lang.org/doc/reference/latest/Type-Classes/Instance-Synthesis/}{Lean 4 Instance Synthesis}
\end{itemize}
\subsection{Liquid Haskell}
\label{sec:orgbff9176}
\begin{itemize}
\item \href{https://nikivazou.github.io/lh-course/Lecture\_01\_RefinementTypes.html}{Refinement Types Tutorial}
\item \href{https://goto.ucsd.edu/\~nvazou/refinement\_types\_for\_haskell.pdf}{Refinement Types for Haskell (paper)}
\end{itemize}
\subsection{Haskell Type Synonyms}
\label{sec:orgb1a9154}
\begin{itemize}
\item \href{https://wiki.haskell.org/Type\_synonym}{GHC Type Synonyms}
\end{itemize}
\subsection{Koka}
\label{sec:org027bd7d}
\begin{itemize}
\item \href{https://koka-lang.github.io/koka/doc/book.html}{Koka Language Book}
\end{itemize}
\subsection{F*}
\label{sec:org66dd166}
\begin{itemize}
\item \href{https://github.com/FStarLang/FStar/wiki/Qualifiers-for-definitions-and-declarations}{F* Qualifier Wiki}
\end{itemize}
