docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.org
** 1ML
- [[https://people.mpi-sws.org/~rossberg/1ml/1ml-extended.pdf][1ML (Rossberg) — Core and Modules United]]

** Racket Contracts
- [[https://docs.racket-lang.org/guide/contracts.html][Racket Contracts Guide]]
