docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.tex
\subsection{1ML}
\label{sec:org364a6ef}
\begin{itemize}
\item \href{https://people.mpi-sws.org/\~rossberg/1ml/1ml-extended.pdf}{1ML (Rossberg) — Core and Modules United}
\end{itemize}
\subsection{Racket Contracts}
\label{sec:orgd6ded2b}
\begin{itemize}
\item \href{https://docs.racket-lang.org/guide/contracts.html}{Racket Contracts Guide}
\end{itemize}
\end{document}
