docs/tracking/2026-02-22_EXTENDED_SPEC_DESIGN.md


<a id="org540723b"></a>

## 1ML

-   [1ML (Rossberg) — Core and Modules United](https://people.mpi-sws.org/~rossberg/1ml/1ml-extended.pdf)


<a id="org8a0795f"></a>

## Racket Contracts

-   [Racket Contracts Guide](https://docs.racket-lang.org/guide/contracts.html)
